{"class_name": "Sequential", "config": {"name": "sequential", "layers": [{"class_name": "AveragePooling2D", "config": {"name": "average_pooling2d", "batch_input_shape": [null, 28, 28, 1], "dtype": "float32", "pool_size": [2, 2], "padding": "valid", "strides": [2, 2], "data_format": "channels_last"}}, {"class_name": "Flatten", "config": {"name": "flatten", "dtype": "float32", "data_format": "channels_last"}}, {"class_name": "Dense", "config": {"name": "dense", "dtype": "float32", "units": 128, "activation": "relu", "use_bias": true}, "kernel_values": [[-0.033059194684028625, -0.18036584556102753, 0.22689063847064972, -0.22286902368068695, 0.08822254091501236, -0.14936180412769318, 0.2287580519914627, 0.2096850872039795, 0.009082806296646595, -0.33476313948631287, -0.2664411664009094, 0.24465234577655792, -0.31062448024749756, -0.13354773819446564, -0.32144805788993835, -0.2574620842933655, -0.2840515375137329, -0.21511441469192505, -0.1045902892947197, 0.09863314777612686, -0.031156674027442932, -0.030807506293058395, -0.04463685676455498, -0.19134770333766937, -0.09102963656187057, -0.26043012738227844, -0.09860740602016449, 0.313083678483963, 0.20096063613891602, -0.42283546924591064, 0.07284214347600937, -0.18218787014484406, 0.41420477628707886, 0.32817190885543823, 0.2786477506160736, 0.2563003599643707, 0.018191203474998474, 0.021245693787932396, 0.05182211101055145, -0.23707886040210724, -0.015092629007995129, 0.012340178713202477, -0.4745407700538635, 0.4199720621109009, -0.17371463775634766, -0.31464383006095886, 0.3577544391155243, 0.31949591636657715, 0.4184262454509735, 0.2598362863063812, 0.10335903614759445, -0.15770331025123596, 0.006602360866963863, 0.11994928866624832, 0.09534373134374619, 0.27497702836990356, -0.2692359983921051, -0.13834965229034424, 0.052728958427906036, 0.14058588445186615, -0.4938393533229828, -0.11325987428426743, 0.31584474444389343, -0.5369266271591187, 0.054056111723184586, 0.08572044223546982, -0.18918542563915253, -0.27158474922180176, 0.08189229667186737, 0.39822444319725037, -0.30106043815612793, -0.027519378811120987, 0.36283111572265625, 0.04734678566455841, 0.16090668737888336, -0.24683427810668945, 0.20294751226902008, -0.2682984173297882, -0.008588727563619614, -0.001788792316801846, -0.40514692664146423, -0.03424529731273651, 0.019602296873927116, 0.011535286903381348, 0.2754853367805481, -0.017934175208210945, 0.1062813401222229, 0.03287958726286888, 0.13446879386901855, -0.16848209500312805, -0.10537251085042953, -0.28049007058143616, -0.11822301894426346, 0.1245858445763588, 0.24662135541439056, -0.33129385113716125, -0.14945268630981445, 0.10965767502784729, 0.12706662714481354, 0.21350222826004028, 0.001008838415145874, 0.09088612347841263, 0.2861480414867401, 0.018026480451226234, 0.23561032116413116, 0.1370650976896286, -0.23839132487773895, 0.33607062697410583, 0.0463007427752018, -0.08496961742639542, 0.2601282298564911, -0.3815036714076996, 0.15565341711044312, -0.12605036795139313, 0.03193071484565735, 0.128525972366333, 0.09371551871299744, -0.037167564034461975, -0.4301215410232544, 0.17717163264751434, -0.33964523673057556, -0.06446395069360733, 0.31543195247650146, -0.281301349401474, 0.19395627081394196, 0.10342137515544891, 0.1658991128206253, 0.0995621532201767], [0.06426340341567993, -0.6605254411697388, 0.14420555531978607, 0.01781989447772503, 0.583612322807312, -0.5244451761245728, 0.050286032259464264, 0.208104208111763, 0.4888632893562317, -0.36978548765182495, -0.5598997473716736, -0.30472564697265625, -0.035566747188568115, 0.0988733172416687, -0.2325850874185562, -0.6680353879928589, -0.488018661737442, -0.4819278419017792, -0.5411891937255859, 0.19462262094020844, -0.059173546731472015, -0.22905205190181732, 0.01735464669764042, -0.619104266166687, -0.7298630475997925, -0.11269553005695343, -0.17355051636695862, -0.08306638896465302, 0.5246696472167969, -0.021972641348838806, -0.2563885748386383, -0.42272260785102844, -0.18331289291381836, -0.3649839162826538, -0.10045567899942398, 0.10107997804880142, 0.00840727798640728, -0.11930771917104721, 0.1503409892320633, 0.08991782367229462, -0.35095423460006714, 0.3084116280078888, 0.33377641439437866, -0.37071892619132996, -0.24705976247787476, -0.49468517303466797, 0.3144116699695587, 0.48690733313560486, 0.25063982605934143, 0.07767099142074585, -0.16096951067447662, -0.13756677508354187, -0.17395518720149994, -0.491483211517334, 0.12881745398044586, 0.07639218121767044, 0.056718356907367706, 0.0017377568874508142, -0.06642322987318039, 0.022369200363755226, 0.2511398196220398, -0.40846705436706543, -0.019219491630792618, -0.01338514406234026, -0.13013766705989838, -0.11936966329813004, 0.08987298607826233, -0.5982492566108704, -0.1803341954946518, 0.18917542695999146, -0.06028151139616966, -0.33836790919303894, 0.010699937120079994, -0.19157078862190247, 0.2834499478340149, -0.42434391379356384, -0.12415904551744461, -0.40525925159454346, -0.2166137546300888, -0.13820010423660278, -0.7646583318710327, -0.0003822185390163213, -0.24447987973690033, -0.12848183512687683, 0.23300524055957794, -0.5717315077781677, 0.07892785221338272, -0.11952602118253708, -0.40465185046195984, 0.05717000737786293, -0.35522371530532837, -0.03239428624510765, -0.051734574139118195, 0.08102262020111084, -0.18386779725551605, 0.051276084035634995, -0.21263931691646576, 0.07064052671194077, -0.0567939430475235, -0.12208208441734314, 0.07857084274291992, -0.06567607820034027, -0.0602441169321537, -0.03631867468357086, 0.016281086951494217, 0.09874413162469864, 0.26065632700920105, -0.20158860087394714, -0.035048067569732666, -0.03054061345756054, -0.2866000235080719, -0.07029566913843155, 0.48364928364753723, -0.09368215501308441, -0.5664574503898621, 0.30810344219207764, -0.6951732039451599, -0.028586219996213913, -0.6200048923492432, 0.027065133675932884, -0.4314025342464447, -0.25560006499290466, 0.1937820315361023, 0.3718954920768738, 0.1063484326004982, -0.025423435494303703, 0.24139034748077393, -0.28437167406082153], [-0.028592310845851898, -0.4202251136302948, -0.4397837221622467, 0.5560432076454163, 0.4397532641887665, -0.07054592669010162, 0.18475376069545746, 0.03584304451942444, 0.24552187323570251, -0.5695222020149231, -0.1424216777086258, 0.33537498116493225, 0.6506064534187317, 0.013109400868415833, 0.018501058220863342, -0.7284183502197266, 0.12424851208925247, 0.02131810039281845, -0.13687840104103088, -0.23380182683467865, 0.055169329047203064, -0.2245228886604309, -0.06276002526283264, -0.2548076808452606, -0.7792560458183289, 0.11581790447235107, 0.18220211565494537, -0.16249141097068787, -0.006008820608258247, 0.44656914472579956, -0.7598246335983276, -0.48855116963386536, -0.24372482299804688, -0.3133929967880249, -0.11957341432571411, -0.42383772134780884, 0.003341039177030325, -0.515722930431366, 0.3243148922920227, -0.06307367235422134, 0.061081890016794205, -0.704136312007904, -0.17702361941337585, -0.6065376400947571, -0.08630257844924927, -0.04357963800430298, 0.04985155537724495, -0.0013358497526496649, -0.14211362600326538, -0.20163334906101227, 0.12908783555030823, -0.08600012958049774, 0.3834081292152405, -0.4045049548149109, -0.35549259185791016, 0.12555880844593048, -0.05834518373012543, 0.1428670734167099, -0.07733960449695587, -0.24924027919769287, 0.10993215441703796, -0.015393324196338654, 0.19285498559474945, -0.09505213797092438, -0.16281825304031372, 0.2643841803073883, 0.9199719429016113, -0.24131803214550018, -0.07623032480478287, -0.30629080533981323, -0.21038156747817993, -0.004027283750474453, -0.3739943504333496, -0.0070725237019360065, 0.062226131558418274, -0.15571069717407227, 0.035095468163490295, 0.5759083032608032, 0.2831701338291168, 0.11280632764101028, -0.8927817344665527, 0.47446128726005554, 0.16952337324619293, 0.23512837290763855, 0.5717825293540955, -0.0683755949139595, -0.058749422430992126, -0.2379479855298996, -0.13434575498104095, 0.5574519038200378, -0.8494970202445984, -0.2822658121585846, 0.32116565108299255, -0.1084120124578476, -0.12116915732622147, -0.2649696469306946, -0.6268495917320251, -0.21588994562625885, -0.6001205444335938, -0.824866533279419, -0.11954712867736816, 0.022959718480706215, -0.25330519676208496, -0.19311609864234924, -0.6024082899093628, -0.5358307957649231, 0.41171762347221375, 0.03661234676837921, -0.10923612117767334, 0.07318931818008423, -0.17141073942184448, 0.3454493582248688, -0.2685743272304535, -0.40460509061813354, -0.5016513466835022, -0.565260112285614, -0.29906806349754333, -0.10124377906322479, 0.0800635814666748, 0.12146038562059402, -0.2777624726295471, 0.35614049434661865, -0.29071828722953796, 0.417269766330719, 0.586079478263855, 0.6867467164993286, -0.18268339335918427, -0.12920181453227997], [-0.06163056567311287, -0.5119177103042603, -0.5131937265396118, 0.1379995495080948, 0.09941347688436508, -0.10023044794797897, -0.06640244275331497, -0.24857710301876068, 0.8182727098464966, -0.741910994052887, -0.10562574118375778, -0.024415355175733566, -0.023642199113965034, 0.09195099771022797, -0.25581565499305725, -0.7110315561294556, 0.21828417479991913, 0.009452070109546185, -0.26308882236480713, -0.7529758214950562, 0.12233800441026688, -0.5951420664787292, -0.34761080145835876, 0.13682259619235992, -0.7951400279998779, 0.2566162645816803, 0.04883040487766266, -0.4175167381763458, 0.15795394778251648, 0.2609986960887909, -0.0719887837767601, 0.6676918268203735, -0.12939712405204773, -0.7891566753387451, -0.12353431433439255, -0.367260217666626, -0.10297960042953491, -0.07293524593114853, 0.3287370502948761, 0.1416073441505432, 0.17653506994247437, -0.21340534090995789, -0.00590952904894948, -0.787898600101471, -0.6446715593338013, 0.024185732007026672, -0.26002976298332214, -0.29793497920036316, -0.49348536133766174, 0.34778913855552673, -0.10151509940624237, 0.1300066113471985, 0.23705387115478516, 0.18855708837509155, -0.09374731779098511, -0.05007603392004967, -0.06519438326358795, 0.14652879536151886, 0.11124259233474731, -0.05387371778488159, 0.14301294088363647, -0.31445983052253723, -0.4950311481952667, 0.14637726545333862, -0.43920832872390747, 0.37587782740592957, 0.5898382067680359, -0.29299065470695496, 0.3506808280944824, -0.32027947902679443, -0.06152665242552757, -0.06355687230825424, 0.02541121281683445, -0.10054866969585419, 0.08025367558002472, -0.34962254762649536, 0.031426072120666504, -0.07763778418302536, -0.031027164310216904, -0.02084776759147644, -1.4987386465072632, 0.5314365029335022, 0.14323954284191132, 0.12105986475944519, 0.0898197740316391, -0.4411356449127197, -0.20087817311286926, -0.28538453578948975, 0.22041170299053192, -0.03345521539449692, -0.4009082615375519, 0.10235534608364105, 0.23879721760749817, -0.05422714352607727, -0.98943692445755, -0.0692528486251831, -0.6605433821678162, -0.18213455379009247, -0.28281837701797485, -1.0035457611083984, -0.1184348538517952, -0.09148966521024704, -0.18713681399822235, -0.10149656236171722, -0.6657418608665466, -0.45206373929977417, 0.09994013607501984, -0.15454494953155518, -0.08998632431030273, -0.25501585006713867, -0.1681784838438034, 0.4662415385246277, -0.45811617374420166, -0.5193067193031311, -0.24063731729984283, -0.2521190941333771, -0.309044748544693, -0.008706999011337757, -0.2368025779724121, -0.42161279916763306, -0.6057927012443542, -0.06111154332756996, -0.1770891398191452, 0.6091710329055786, 0.2485063076019287, 0.5407220721244812, -0.3486226499080658, -0.9010117650032043], [0.031018467620015144, -0.017480703070759773, -0.4396207928657532, -0.36407220363616943, -0.262712687253952, -0.41064542531967163, 0.2770872116088867, 0.10174815356731415, 0.14547666907310486, -0.060218457132577896, -0.43372178077697754, 0.2849876284599304, -0.12083809822797775, -0.05716036260128021, -0.09726344794034958, -1.4805489778518677, -0.2451818287372589, 0.23695725202560425, -0.3305525481700897, -0.6289653182029724, -0.12337146699428558, 0.032637983560562134, -0.40120208263397217, -0.10022931545972824, -0.9600898623466492, 0.18939822912216187, 0.09968327730894089, 0.056472185999155045, 0.4547225832939148, -0.37930503487586975, 0.35191866755485535, 0.6534700393676758, 0.2942810654640198, 0.21671421825885773, -0.15267416834831238, -0.5946904420852661, 0.015819432213902473, -0.18419821560382843, 0.08257964998483658, -0.6576697826385498, -0.13022446632385254, 0.01965663768351078, -0.07382743805646896, -0.16547821462154388, 0.042894892394542694, 0.21537216007709503, 0.13243573904037476, 0.04401155933737755, -0.047466304153203964, -0.15540750324726105, -0.4577657878398895, -0.3338547348976135, -0.03440544009208679, 0.5063616037368774, 0.05100804194808006, 0.048674169927835464, -0.4825578033924103, -0.05703812465071678, 0.08901554346084595, -0.320295125246048, 0.2798255980014801, -0.4582032859325409, 0.008351226337254047, 0.6917780637741089, -0.3091399371623993, 0.1433921605348587, 0.2333797961473465, -0.05598564073443413, -0.23411010205745697, 0.14986099302768707, -0.6032256484031677, -0.31487151980400085, 0.28975555300712585, 0.014586841687560081, 0.32160642743110657, 0.17108340561389923, 0.2355727106332779, 0.1444704681634903, -0.15392069518566132, -0.258197546005249, -0.10399612784385681, 0.21280093491077423, -0.24110639095306396, 0.006403950043022633, 0.33845171332359314, -0.1442168802022934, -0.10921492427587509, -0.2738913893699646, -0.5164601802825928, -1.7292097806930542, -0.01368403248488903, 0.30240169167518616, 0.16728834807872772, 0.26757192611694336, -0.1209004744887352, 0.21589258313179016, -0.3214372396469116, -0.36846160888671875, -0.0036969580687582493, -0.3367517590522766, 0.08637787401676178, -0.05069183558225632, 0.02026057057082653, 0.10916455090045929, -0.5981146097183228, -0.12065309286117554, -0.044806964695453644, -0.4055527150630951, 0.04346676170825958, -0.4952956438064575, 0.18040549755096436, -0.05983024463057518, 0.29908472299575806, -0.04546486586332321, 0.06326297670602798, 0.11558745801448822, -0.41952693462371826, -0.12415169179439545, -0.7536429762840271, 0.004548570606857538, -0.14148852229118347, 0.06258172541856766, -0.15418681502342224, 0.10621479898691177, 0.16588957607746124, -0.3158649802207947, -0.42855432629585266, -1.0618207454681396], [-0.021116117015480995, 0.38693732023239136, 0.25079238414764404, -0.05272085219621658, -0.16705624759197235, -0.41104742884635925, 0.13501332700252533, -0.07183731347322464, -1.2781025171279907, 0.22926869988441467, -0.2907712459564209, 0.43696844577789307, 0.5963693857192993, -0.04288841411471367, 0.136466383934021, -0.7471731305122375, 0.18516358733177185, -0.11363332718610764, -0.01079808734357357, -0.13673201203346252, -0.005451952572911978, 0.10740882158279419, -0.3723795711994171, -0.1779404729604721, 0.18330645561218262, 0.19815631210803986, 0.42451563477516174, 0.14202740788459778, -0.35559573769569397, -0.45278340578079224, 0.42759427428245544, 0.2512834668159485, 0.43033429980278015, 0.5038320422172546, -0.35786962509155273, 0.013472148217260838, -0.07209380716085434, -0.24930958449840546, 0.10469747334718704, -0.20169973373413086, -0.004569079261273146, -0.030081667006015778, -0.30701789259910583, 0.28708580136299133, 0.1799905151128769, 0.2879309356212616, 0.5825074911117554, -0.16723991930484772, 0.26161694526672363, -0.2046152651309967, -0.37505608797073364, -0.28237980604171753, 0.060224127024412155, 0.4877878725528717, -0.33443623781204224, -0.29711198806762695, -0.6860142946243286, -0.22533193230628967, 0.46415403485298157, -0.4518386423587799, -0.05162125453352928, 0.09569036960601807, 0.29798075556755066, 0.7276571989059448, -0.003877256764099002, 0.11923733353614807, 0.22844298183918, -0.24071283638477325, -0.1919175088405609, -0.12423911690711975, -0.3266841471195221, 0.04162217304110527, 0.0804053321480751, 0.14942333102226257, -0.05261630937457085, 0.29174456000328064, -0.15491138398647308, 0.6472182273864746, -0.014187311753630638, -0.1059456318616867, 0.051780328154563904, 0.3832269012928009, 0.09221797436475754, -0.1564270406961441, 0.21949997544288635, -0.14318829774856567, -0.048749424517154694, 0.02532378025352955, -0.2695292532444, -0.8853290677070618, -0.12389551103115082, 0.23879610002040863, 0.014645676128566265, -0.07765204459428787, 0.29094818234443665, -0.4773455560207367, 0.24773456156253815, -0.141584575176239, 0.2893078327178955, 0.4189208447933197, -0.059008654206991196, -0.12921808660030365, 0.21937499940395355, 0.1266767978668213, -0.2841610014438629, 0.004146079532802105, -0.33339089155197144, -0.08138575404882431, -0.12039496004581451, -0.12775908410549164, 0.02639828249812126, -0.1172468438744545, 0.005927013698965311, 0.49393853545188904, 0.21691246330738068, -0.23083677887916565, -0.16853606700897217, -0.0725129097700119, -0.544226348400116, 0.04318029806017876, -0.009372851811349392, -0.10151780396699905, -0.00018030412320513278, -0.04244070500135422, 0.36035916209220886, -0.14638878405094147, -0.17637573182582855, -0.4431033432483673], [0.07568498700857162, -0.06704766303300858, 0.060103725641965866, 0.1638847440481186, 0.281151682138443, 0.3003827631473541, 0.19280724227428436, -0.05517204850912094, -2.255556344985962, 0.3655532896518707, 0.26538804173469543, 0.11285296082496643, 0.318156898021698, 0.04333927482366562, -0.16485847532749176, -0.18085229396820068, 0.23086874186992645, 0.17672310769557953, 0.2750941812992096, 0.2972888946533203, -0.06552267074584961, 0.05159914493560791, 0.2281164675951004, -0.2611488997936249, 0.24712081253528595, -0.12951117753982544, -0.08933510631322861, 0.12470190972089767, -0.9573187232017517, 0.2620590925216675, -0.18167148530483246, -0.14946644008159637, -0.2982199490070343, 0.014638816006481647, -0.2853437662124634, 0.20030689239501953, -0.13408052921295166, 0.1521047204732895, 0.3689275085926056, 0.43615323305130005, -0.024285834282636642, 0.20665667951107025, 0.10749159008264542, 0.22839196026325226, 0.062234338372945786, -0.03513263165950775, -0.10733575373888016, 0.08287834376096725, -0.00770374434068799, -0.3814777731895447, 0.15491925179958344, 0.12090101838111877, -0.02148812636733055, -0.026484431698918343, 0.015636179596185684, -0.06975643336772919, -0.04782586917281151, 0.2707744538784027, 0.34585827589035034, -0.26678764820098877, -0.002527679316699505, 0.49516865611076355, 0.1676596850156784, -0.6052531599998474, 0.04299573972821236, 0.017142852768301964, 0.35929667949676514, -0.4918602406978607, 0.18546314537525177, -0.4149048328399658, 0.3881767988204956, 0.4183541536331177, 0.05855506286025047, 0.18787238001823425, 0.055595867335796356, 0.2608829438686371, -0.10813723504543304, 0.2214832603931427, -0.12112252414226532, -0.23226900398731232, 0.13920730352401733, -0.26897215843200684, 0.21053358912467957, 0.1657058149576187, -0.06362063437700272, -0.6671486496925354, 0.20422956347465515, 0.16789831221103668, -0.07648805528879166, 0.5443263649940491, -0.07720308005809784, -0.18768271803855896, 0.1080956906080246, -0.27755576372146606, 0.03651804104447365, -0.09040138870477676, 0.20328763127326965, 0.23217330873012543, 0.08227180689573288, 0.04181678965687752, -0.006537379696965218, -0.13262084126472473, 0.23081177473068237, 0.38052472472190857, 0.3115701973438263, 0.0670463889837265, 0.35882923007011414, -0.0019666014704853296, -0.11660172790288925, -0.18768243491649628, 0.2924814522266388, 0.41027626395225525, -0.05140945687890053, 0.39502543210983276, -0.03860750049352646, -0.25459182262420654, 0.48642054200172424, 0.07660850882530212, -0.09919952601194382, 0.2764896750450134, 0.11440569907426834, 0.1633676290512085, 0.11069224774837494, 0.2142639458179474, 0.4178546965122223, -0.1655065268278122, 0.007444321643561125, 0.4996662139892578], [0.0530221089720726, -0.04836570844054222, 0.12102408707141876, 0.15413782000541687, 0.09741482883691788, 0.2159101516008377, 0.1764700710773468, 0.12495794147253036, -2.0954363346099854, 0.2918643057346344, 0.6499881148338318, 0.3558761477470398, 0.28236088156700134, 0.006040759850293398, -0.10591316223144531, 0.37768056988716125, 0.24143123626708984, 0.06684163957834244, 0.2223709374666214, 0.21058563888072968, -0.034936875104904175, -0.1641557812690735, 0.341635525226593, -0.2312317043542862, 0.529860258102417, -0.05965028330683708, 0.1044049859046936, 0.08002247661352158, -1.0823570489883423, 0.1292380541563034, -0.06131720542907715, -0.404787540435791, -0.233900249004364, 0.3215460479259491, -0.23083728551864624, 0.35792216658592224, -0.03307449445128441, 0.29177287220954895, 0.043596088886260986, 0.367863267660141, 0.34821879863739014, 0.3743135333061218, -0.05116106569766998, 0.38404110074043274, 0.31703147292137146, 0.08716966211795807, -0.1516786366701126, 0.13129742443561554, 0.0648157149553299, -0.47238585352897644, -0.03696715831756592, 0.13164502382278442, -0.07801177352666855, -0.3589983582496643, -0.09777695685625076, 0.03771723434329033, -0.14106641709804535, 0.3324701189994812, 0.26363369822502136, -0.1001775711774826, -0.21163654327392578, 0.36296346783638, 0.0601460225880146, -0.8453350067138672, 0.24910661578178406, -0.04127955064177513, 0.28839823603630066, -0.2964763343334198, 0.41813260316848755, -0.3918015956878662, 0.20895585417747498, 0.2736976444721222, 0.04990934208035469, 0.3790739178657532, -0.09193573892116547, 0.34509992599487305, 0.16884171962738037, 0.1350475698709488, 0.0144159235060215, -0.4799884259700775, 0.28634074330329895, -0.287117600440979, 0.33669185638427734, -0.07855537533760071, 0.04396980255842209, -0.6467704176902771, 0.07811659574508667, 0.29218393564224243, -0.03190343454480171, 0.6157018542289734, -0.09210430085659027, -0.3054858148097992, 0.03367684781551361, -0.15365169942378998, -0.0037370692007243633, -0.23103350400924683, 0.370419979095459, 0.04517900571227074, 0.026074206456542015, 0.3395802080631256, -0.04374808445572853, -0.19910235702991486, 0.19993728399276733, 0.4577730596065521, 0.31921282410621643, 0.2059325873851776, 0.1726439893245697, 0.01728731580078602, 0.08931538462638855, -0.2098030298948288, 0.3919295370578766, 0.2963084876537323, 0.1438695788383484, 0.4947710335254669, 0.23885700106620789, -0.154612734913826, 0.534680962562561, -0.05895310267806053, 0.17834442853927612, 0.20429959893226624, 0.2553335726261139, 0.12755516171455383, 0.09743023663759232, 0.29613444209098816, 0.27863186597824097, -0.09567451477050781, 0.02362714521586895, 0.5839016437530518], [-0.13921189308166504, 0.1455938220024109, 0.09740874916315079, -0.14120560884475708, -0.35700663924217224, -0.232580304145813, 0.13740015029907227, 0.08563599735498428, -1.8742737770080566, 0.3945350646972656, 0.04632357507944107, 0.4444669783115387, 0.36259016394615173, 0.1037740632891655, 0.1610526740550995, -0.1946016401052475, 0.27529406547546387, 0.05639386177062988, -0.1697225421667099, -0.28071290254592896, 0.11534392833709717, 0.017586180940270424, -0.22420047223567963, -0.0034416853450238705, 0.34933504462242126, 0.2591995894908905, 0.39117005467414856, -0.00856397207826376, -0.27527937293052673, -0.22493861615657806, 0.4008280038833618, 0.191123366355896, 0.2677725553512573, 0.52364182472229, -0.2369605153799057, 0.2506667673587799, -0.0502968467772007, 0.13925813138484955, -0.11919175833463669, -0.018492817878723145, 0.08761490881443024, -0.10567029565572739, -0.11933939158916473, 0.29390203952789307, 0.34162965416908264, 0.07374440133571625, 0.4421719014644623, 0.03248582407832146, 0.5435065031051636, -0.178045392036438, -0.35579243302345276, 0.03651327267289162, 0.12573683261871338, 0.30890756845474243, -0.06757082045078278, -0.1773655116558075, -0.5880241394042969, -0.23495982587337494, 0.3363410532474518, -0.09892929345369339, -0.05219132825732231, 0.06695733219385147, -0.0700073167681694, 0.28757914900779724, 0.10042695701122284, 0.2517216205596924, -0.15304192900657654, -0.3874482214450836, -0.1347053349018097, 0.0248244721442461, -0.26502788066864014, -0.15160208940505981, 0.20809772610664368, 0.024537790566682816, -0.0065630897879600525, 0.20914994180202484, 0.0873243659734726, 0.5632928609848022, 0.07600848376750946, -0.1840542107820511, 0.18514518439769745, 0.1468251496553421, 0.08935479819774628, -0.18786181509494781, 0.25291791558265686, -0.0418836735188961, 0.09418879449367523, 0.06519819796085358, -0.12486964464187622, -0.6366385817527771, 0.01610882580280304, 0.33756086230278015, 0.07564441114664078, -0.39277005195617676, 0.323434978723526, -0.325054794549942, 0.2978030741214752, 0.019376112148165703, 0.341194748878479, 0.3983685374259949, -0.1419532597064972, -0.4281288981437683, 0.08687327057123184, 0.44803789258003235, -0.13426175713539124, 0.12134718149900436, -0.39401137828826904, 0.08243555575609207, 0.06556345522403717, -0.2937343716621399, 0.23513253033161163, -0.2750249207019806, 0.09099942445755005, 0.4411340653896332, 0.17996780574321747, -0.043174032121896744, 0.17177635431289673, 0.11626065522432327, -0.05259488523006439, -0.11725445836782455, -0.057642750442028046, 0.00010624255082802847, 0.09121106564998627, 0.06490667909383774, 0.1583317518234253, -0.06389308720827103, -0.295271635055542, -0.26860716938972473], [0.06556085497140884, 0.1542883962392807, -0.26808875799179077, -0.49898821115493774, -0.6337029337882996, -0.06897933036088943, -0.11932172626256943, 0.08875814825296402, -0.29461047053337097, -0.2075202912092209, -0.3887634575366974, 0.4229585826396942, 0.22076518833637238, 0.06632474064826965, -0.25969862937927246, -0.5187967419624329, 0.07115161418914795, 0.2805616557598114, -0.34502193331718445, -0.6222683191299438, -0.03524070978164673, -0.07232636213302612, -0.5347596406936646, 0.22020156681537628, -0.5507948994636536, 0.4631180167198181, 0.397260457277298, -0.06335824728012085, 0.5171563625335693, -0.5812014937400818, 0.7688146233558655, 0.3872889578342438, 0.5161154270172119, 0.2841888964176178, -0.11454365402460098, -0.3799310624599457, -0.13372229039669037, -0.13969919085502625, -0.05007275193929672, -0.5534929633140564, 0.06817660480737686, 0.2208886593580246, -0.48580092191696167, 0.13887904584407806, 0.11899393051862717, 0.23837456107139587, 0.4081827700138092, 0.1642119139432907, 0.32991084456443787, -0.08377757668495178, -0.1902070790529251, 0.12230318784713745, 0.24408435821533203, 0.550094723701477, -0.059927575290203094, -0.08683815598487854, -0.8578289151191711, -0.3549613058567047, 0.3870198130607605, -0.15128132700920105, -0.0968792662024498, -0.5048752427101135, 0.1352548748254776, 0.6647825837135315, -0.45497775077819824, 0.4901704788208008, -0.0109852971509099, -0.11812712252140045, 0.1509559452533722, 0.2048153430223465, -0.49649477005004883, -0.652755081653595, 0.2558023929595947, -0.018004918470978737, 0.047651711851358414, -0.0048222774639725685, 0.36182668805122375, 0.2083149403333664, 0.19636352360248566, -0.0043193623423576355, -0.14259323477745056, 0.184552863240242, -0.2999296486377716, -0.42531949281692505, 0.07746141403913498, -0.2909972667694092, 0.09836184233427048, -0.2961580753326416, -0.5002192854881287, -2.283054828643799, -0.0017476852517575026, 0.32699865102767944, 0.319223016500473, -0.20476731657981873, -0.2659142017364502, -0.23136554658412933, 0.07316490262746811, -0.07539838552474976, 0.2590550184249878, 0.17716719210147858, 0.08870570361614227, -0.28447264432907104, 0.16702763736248016, -0.15201407670974731, -0.556728720664978, -0.1453104019165039, -0.29334667325019836, -0.27293187379837036, -0.06910349428653717, -0.36767223477363586, 0.20129932463169098, -0.23236176371574402, -0.078417107462883, -0.05284855514764786, 0.44726529717445374, -0.027388010174036026, -0.28941959142684937, -0.12773554027080536, -0.186727836728096, 0.15403692424297333, -0.33421453833580017, 0.2533412575721741, -0.0035882266238331795, 0.10593198984861374, 0.047423895448446274, -0.2948886454105377, -0.07350515574216843, -1.1298977136611938], [0.09896503388881683, -0.33456772565841675, -0.30068114399909973, -0.28033554553985596, 0.0568871796131134, -0.24195533990859985, -0.3345063030719757, 0.010433867573738098, 0.5044732689857483, -0.7715789675712585, 0.10620776563882828, 0.21830038726329803, -0.03170221671462059, -0.03289482742547989, -0.42363476753234863, -0.1979008913040161, 0.4980020523071289, -0.2786490321159363, -0.44679364562034607, -0.6739102602005005, 0.12622341513633728, -0.7352238893508911, -0.35601386427879333, 0.1355370730161667, -0.7723264098167419, 0.5094614028930664, 0.22656285762786865, -0.4922304153442383, 0.5829288959503174, -0.06775182485580444, 0.7871794700622559, 0.2711280584335327, -0.0660347267985344, -0.4966305196285248, -0.2428223341703415, -0.18284821510314941, -0.07608923316001892, 0.09626000374555588, -0.046143874526023865, 0.09038586169481277, 0.2097560614347458, 0.3815777003765106, -0.5046478509902954, -0.3309521973133087, -0.06555288285017014, 0.007536299992352724, -0.16971297562122345, -0.22718282043933868, 0.1693572700023651, 0.4154044985771179, -0.29778724908828735, 0.5367822051048279, 0.4346267282962799, 0.7570153474807739, -0.10269858688116074, -0.5503026843070984, -0.4177437126636505, -0.2523393929004669, 0.024767762050032616, 0.3957393765449524, -0.1662583202123642, -0.4484005570411682, -0.3871665298938751, -0.15156789124011993, -0.5017077922821045, 0.578682541847229, 0.00447005545720458, -0.11225318908691406, 0.18830230832099915, -0.2324436753988266, 0.14690449833869934, -0.1038530170917511, 0.3933931291103363, -0.04893839731812477, 0.13359199464321136, 0.016782201826572418, 0.3480384647846222, -0.03356371447443962, -0.04733731597661972, 0.04880128800868988, -1.7729036808013916, 0.39585351943969727, -0.00992907676845789, -0.38038545846939087, -0.5764791965484619, -0.21687275171279907, 0.389259934425354, -0.623033344745636, 0.2802044451236725, -0.30038249492645264, -0.6122984886169434, 0.18350060284137726, 0.20378275215625763, 0.03864409402012825, -0.7354355454444885, -0.02872883714735508, -0.2472437471151352, -0.4158730208873749, 0.0038987798616290092, -1.0518428087234497, 0.005672403145581484, 0.07436425238847733, 0.11101289838552475, 0.0708894208073616, -0.35842591524124146, -0.5359265804290771, 0.1792476326227188, -0.04700138419866562, 0.09038226306438446, -0.3331993520259857, 0.1121196523308754, -0.1657959371805191, -0.3254425525665283, 0.040888044983148575, 0.0564785972237587, -0.11553803086280823, -0.4323464334011078, -0.018900737166404724, -0.3721831142902374, -0.38282454013824463, -0.9521535634994507, -0.1409764438867569, -0.32242679595947266, 0.5490232110023499, 0.4406128525733948, -0.4090535044670105, -0.12441112101078033, -0.7179220914840698], [0.10672803968191147, -0.42973792552948, -0.13299061357975006, 0.22397275269031525, 0.05664675682783127, 0.05048724263906479, 0.30735456943511963, -0.08530886471271515, 0.21565307676792145, -0.8390362858772278, 0.30889466404914856, 0.5749896764755249, 0.34028303623199463, 0.04467032849788666, -0.050948645919561386, -0.20758186280727386, 0.3910802900791168, 0.24630498886108398, -0.4386281371116638, 0.19751474261283875, -0.05224674195051193, -0.2177956998348236, -0.2171451598405838, -0.07236986607313156, -0.7558962106704712, 0.5751645565032959, 0.6541785597801208, 0.08003000915050507, 0.2844865322113037, 0.432636559009552, -0.3652634024620056, -0.15484388172626495, -0.5996352434158325, -0.7222214937210083, -0.08771337568759918, -0.10303178429603577, 0.11482962220907211, -0.25214290618896484, 0.29322513937950134, 0.16164380311965942, 0.34650278091430664, -0.3969988226890564, -0.6025033593177795, -0.22766366600990295, -0.1943230777978897, -0.3603254556655884, 0.046940021216869354, -0.00016724548186175525, 0.11503181606531143, 0.11289291083812714, -0.1745496690273285, -0.2872392237186432, 0.3672458529472351, 0.022122031077742577, -0.6315997838973999, 0.01626589708030224, -0.0008409020956605673, -0.013760331086814404, 0.06516151875257492, 0.14930963516235352, -0.4482221305370331, -0.637203574180603, 0.8154340982437134, -0.2899273633956909, 0.05862388014793396, 0.7185592651367188, 0.6372867822647095, 0.07033209502696991, -0.5049305558204651, -0.0793958455324173, -0.4858804941177368, -0.0561857745051384, -0.3232998251914978, -0.02944336086511612, -0.11564178019762039, -0.24799533188343048, 0.41355594992637634, 0.6377174854278564, 0.35296911001205444, 0.7896988391876221, -0.8515967726707458, 0.20910227298736572, 0.5936779975891113, 0.06068066135048866, 0.29197198152542114, -0.21636080741882324, 0.030562473461031914, -0.14210888743400574, 0.13721071183681488, 0.46964195370674133, -1.1787623167037964, -0.5533839464187622, 0.12714865803718567, 0.26212888956069946, -0.3996922969818115, -0.45256441831588745, -0.30328628420829773, 0.23200488090515137, -0.7070075869560242, -0.8054496049880981, 0.06229091063141823, 0.23368987441062927, 0.1123342514038086, -0.07701070606708527, -0.4465310275554657, -0.9216853976249695, 0.4306561350822449, 0.39202356338500977, -0.09436699748039246, 0.09481431543827057, -0.12702658772468567, -0.08053252100944519, -0.6674850583076477, -0.16549138724803925, -0.20185263454914093, -0.43634122610092163, 0.0045761168003082275, -0.13539789617061615, 0.034531205892562866, 0.16790437698364258, -0.41398999094963074, 0.40842172503471375, -0.12404108047485352, 0.5911169052124023, 0.4437737464904785, -0.2405637949705124, -0.010069458745419979, 0.3826294243335724], [0.13099214434623718, -0.77116858959198, 0.03552591800689697, 0.31662216782569885, 0.2519911527633667, 0.06763403117656708, 0.14615793526172638, -0.3511514663696289, 0.3178545832633972, -0.577124297618866, 0.3554416298866272, -0.35463958978652954, 0.06067319214344025, -0.11850350350141525, 0.0504770502448082, -0.546027421951294, -0.5531191825866699, 0.24493466317653656, -0.33690935373306274, 0.0974637120962143, 0.10552486777305603, -0.32570409774780273, 0.7279136180877686, -0.24048662185668945, -0.8904536366462708, 0.14757084846496582, 0.13023290038108826, 0.03618292137980461, 0.15667563676834106, 0.493663489818573, 0.17322061955928802, 0.031354907900094986, -0.5873196721076965, -0.28134769201278687, 0.4089455008506775, 0.10141804069280624, 0.05656663700938225, 0.16495157778263092, -0.11711180210113525, 0.6321596503257751, 0.23590980470180511, -0.2036324441432953, 0.17705702781677246, -0.30035632848739624, -0.22142328321933746, -0.8203858137130737, -0.35764914751052856, 0.0018828255124390125, -0.36723247170448303, 0.2588941752910614, -0.05373801290988922, -0.39673182368278503, -0.2933274805545807, -0.3428601026535034, -0.20933961868286133, 0.3916524350643158, 0.4170219600200653, -0.12233202159404755, -0.36294400691986084, 0.3592415153980255, 0.23593755066394806, -0.26822277903556824, 0.18513616919517517, 0.6199101209640503, 0.4203045964241028, 0.03219933062791824, 0.09740693867206573, -0.32018208503723145, -0.36569416522979736, -0.0302952378988266, -0.028101520612835884, -0.3322901129722595, 0.15757909417152405, 0.109583280980587, 0.026874013245105743, 0.07437059283256531, 0.2573164999485016, -0.08301199972629547, -0.07230095565319061, 0.05866390839219093, -0.7859471440315247, -0.19707156717777252, 0.22815944254398346, 0.335828572511673, 0.18421727418899536, 0.056777480989694595, 0.05568552017211914, -0.2710587978363037, 0.2541751265525818, 0.028959911316633224, -0.5445277094841003, 0.032872553914785385, -0.04982319846749306, 0.3293914198875427, -0.284631609916687, 0.03414151445031166, -0.12925739586353302, 0.6251740455627441, -0.5410777926445007, -0.22189591825008392, -0.05101436376571655, -0.0042672608979046345, -0.41880589723587036, 0.32972609996795654, 0.3215443789958954, -0.32870152592658997, 0.39228931069374084, 0.3975049555301666, -0.006743250414729118, 0.1381129026412964, -0.2821155786514282, 0.31283724308013916, 0.25878971815109253, 0.16481465101242065, -1.0332591533660889, 0.14709652960300446, -0.4637046456336975, -0.04329320788383484, 0.0404382087290287, -0.09891796857118607, -0.31122300028800964, 0.07120229303836823, -0.13878455758094788, 0.3544843792915344, -0.3295234739780426, -0.965348482131958, 0.10224588215351105, 0.06188039481639862], [-0.02325386554002762, -0.0962764099240303, 0.4664284884929657, -0.39409056305885315, 0.11838723719120026, -0.18225830793380737, -0.05835173279047012, -0.12873055040836334, 0.0628172978758812, -0.32010141015052795, 0.11989496648311615, 0.18188053369522095, 0.4569514989852905, -0.07631947845220566, -0.25083571672439575, -0.27566948533058167, -0.16889962553977966, -0.14739163219928741, -0.07056981325149536, 0.3101358413696289, -0.07629316300153732, -0.570081353187561, 0.44145065546035767, -0.11957220733165741, -0.2463805228471756, 0.3199252784252167, 0.23876343667507172, 0.3021771311759949, 0.15221939980983734, -0.149147629737854, -0.17366527020931244, 0.255350798368454, -0.02852044813334942, 0.49356716871261597, -0.027679258957505226, 0.30969563126564026, 0.1258213073015213, 0.01702244020998478, -0.2686752676963806, 0.26897212862968445, 0.1727183312177658, 0.1668427437543869, -0.14340728521347046, 0.29530635476112366, 0.14951156079769135, -0.49169260263442993, 0.19848322868347168, 0.09258416295051575, 0.02406589686870575, 0.21820436418056488, -0.08528529852628708, -0.15670466423034668, 0.26326125860214233, -0.13406561315059662, -0.2978266775608063, -0.16474592685699463, -0.3198173940181732, -0.44378671050071716, -0.10241517424583435, 0.30987679958343506, -0.5224913954734802, -0.06549444049596786, 0.07109613716602325, -0.36926278471946716, 0.24288469552993774, 0.029547760263085365, -0.32050663232803345, 0.027394339442253113, -0.2446306049823761, 0.4335644245147705, -0.4967217445373535, -0.6521873474121094, 0.5845509767532349, -0.1986948549747467, 0.12173033505678177, -0.3888392448425293, 0.37554052472114563, -0.20667769014835358, -0.016290128231048584, 0.39857664704322815, -0.3343234956264496, -0.05156119540333748, 0.14891189336776733, 0.07391049712896347, 0.28167203068733215, -0.13137176632881165, -0.1527220755815506, 0.03077566996216774, 0.4480891227722168, -0.5305092334747314, -0.32614561915397644, -0.11921926587820053, -0.12159791588783264, -0.04333941638469696, 0.09175293147563934, -0.548607587814331, 0.0027100960724055767, 0.41727617383003235, 0.13406537473201752, 0.07402604073286057, -0.09921040385961533, 0.08525028824806213, 0.2504872977733612, 0.0208352729678154, -0.055778443813323975, -0.25961416959762573, -0.07238476723432541, 0.36578547954559326, -0.11404421180486679, 0.018056638538837433, -0.012865498661994934, -0.29762256145477295, -0.12678897380828857, 0.04464947059750557, -0.11572127044200897, -0.25317490100860596, -0.19299885630607605, 0.10480968654155731, -0.23033791780471802, 0.2517588436603546, -0.07513492554426193, -0.1252318173646927, 0.3193691372871399, 0.035968001931905746, 0.2195512056350708, -0.4439043402671814, -0.14577656984329224, 0.059121061116456985], [-0.08777400106191635, -0.2697884738445282, 0.023186935111880302, 0.4228784739971161, -0.13930265605449677, 0.12680914998054504, 0.0488174706697464, -0.15084299445152283, -0.35614219307899475, -0.42827001214027405, 0.04387949779629707, 0.48114949464797974, -0.19809432327747345, -0.09738806635141373, -0.2663654088973999, -0.0008596869884058833, 0.0024251204449683428, -0.2662281394004822, 0.19110164046287537, -0.2602699100971222, 0.13372182846069336, -0.009659487754106522, -0.26391932368278503, 0.29078641533851624, 0.13123993575572968, -0.027064045891165733, 0.2944454550743103, -0.00027380743995308876, -0.49602454900741577, 0.545957624912262, -0.21160824596881866, -0.3737320601940155, 0.030967816710472107, 0.23058336973190308, -0.2874351441860199, -0.1620638221502304, -0.04257515072822571, 0.12176279723644257, -0.05452665686607361, 0.03134874999523163, 0.15737397968769073, 0.00736227398738265, 0.46137988567352295, -0.021630261093378067, -0.02678716368973255, 0.03777352347970009, -0.08031441271305084, -0.5212604999542236, -0.16081087291240692, -0.13502895832061768, 0.12775473296642303, 0.4017322361469269, -0.21003246307373047, 0.21793244779109955, -0.14217519760131836, 0.20574884116649628, 0.22270230948925018, 0.010525527410209179, -0.05132398009300232, -0.23315025866031647, 0.45608022809028625, -0.5652135610580444, 0.11062797904014587, 0.17389808595180511, -0.024458112195134163, -0.2823796570301056, -0.014368382282555103, 0.28141486644744873, -0.7250262498855591, -0.051846232265233994, -0.07785937935113907, -0.3096456229686737, -0.040423329919576645, 0.10398928821086884, -0.19703227281570435, -0.0993998646736145, 0.03200281038880348, -0.3168182671070099, 0.16268114745616913, -0.1537916511297226, 0.46558046340942383, 0.4852498173713684, 0.18361741304397583, 0.48280230164527893, 0.5586764812469482, 0.20207898318767548, 0.0722595602273941, 0.2683545649051666, -0.03208620846271515, 0.09658338874578476, -0.24539825320243835, 0.028528159484267235, -0.12592139840126038, 0.014882347546517849, -0.3631778359413147, 0.2321988344192505, -0.03671781346201897, -0.14791594445705414, -0.3449525833129883, -0.06088082864880562, -0.0868082195520401, 0.052086133509874344, -0.23709425330162048, 0.05968140810728073, -0.6757949590682983, -0.18360021710395813, 0.030765747651457787, 0.05462944135069847, -0.13745860755443573, 0.21209459006786346, -0.265360563993454, 0.42969030141830444, 0.193008154630661, -0.38853442668914795, -0.1424940675497055, 0.142739400267601, -0.2406391054391861, 0.11295183002948761, -0.2629135251045227, -0.021111808717250824, 0.3868785500526428, 0.11023082584142685, -0.3710530996322632, -0.07708591222763062, -0.3726693093776703, -0.2663809657096863, 0.0022196366917341948, -0.15377455949783325], [0.06533906608819962, -0.9495463371276855, -0.11546359211206436, 0.2703264057636261, 0.27322402596473694, -0.48753827810287476, 0.09493730962276459, 0.007424175273627043, 0.2370152473449707, -0.5998021960258484, -0.3900563418865204, -0.08930977433919907, -0.17601191997528076, -0.09092651307582855, -0.16925345361232758, -0.5652747750282288, -0.379915714263916, -0.24969981610774994, -0.3338925838470459, 0.19571278989315033, 0.06979894638061523, -0.3843108117580414, 0.21921956539154053, -0.5395535826683044, -0.45342251658439636, -0.1366693526506424, -0.2552207112312317, -0.18479818105697632, 0.3313971757888794, 0.216334730386734, -0.024048158898949623, -0.13657787442207336, 0.07008951902389526, -0.16228489577770233, -0.08489415794610977, 0.025991739705204964, -0.03994942456483841, 0.03657624498009682, -0.11762433499097824, 0.5925297141075134, -0.014992616139352322, 0.25476163625717163, 0.08629246801137924, -0.37821850180625916, -0.5022012591362, -0.31995752453804016, 0.25934898853302, 0.1585763543844223, -0.022510021924972534, 0.17157775163650513, -0.15420524775981903, 0.11430209875106812, -0.32116368412971497, -0.05609751492738724, 0.07519733905792236, -0.19219538569450378, -0.08941437304019928, -0.23460277915000916, -0.0013727245386689901, 0.3722725808620453, 0.20624306797981262, -0.33548110723495483, -0.25003767013549805, -0.0003486512287054211, -0.2514733076095581, 0.23948636651039124, -0.047242019325494766, -0.04320993646979332, -0.12843173742294312, -0.21330773830413818, 0.13762792944908142, -0.3016880452632904, -0.1084853932261467, 0.016050228849053383, 0.07746587693691254, 0.08904264867305756, -0.11598023027181625, -0.5181108713150024, -0.3487442135810852, -0.405670702457428, -0.6256136298179626, 0.04394522309303284, 0.0326567180454731, -0.12605684995651245, 0.4081445634365082, -0.2310558259487152, -0.04593822360038757, 0.06311813741922379, -0.07093680649995804, 0.23558920621871948, -0.4290725290775299, 0.0939488559961319, 0.0764026790857315, 0.11065853387117386, -0.6265140175819397, -0.08516476303339005, -0.3563384711742401, 0.14252202212810516, 0.22843848168849945, -0.5976055860519409, 0.03149712085723877, -0.11215762794017792, -0.1183772161602974, 0.05168548598885536, 0.1557871252298355, -0.2390774041414261, 0.01811937429010868, 0.027702894061803818, 0.006537395995110273, -0.03739991411566734, -0.08905837684869766, 0.000832548423204571, 0.25045523047447205, -0.17268909513950348, -0.35078635811805725, 0.3576533794403076, -0.5693436861038208, -0.00535836536437273, -0.5355345606803894, -0.11199793964624405, 0.11232129484415054, -0.2796070873737335, -0.12716221809387207, 0.23391194641590118, -0.20047155022621155, 0.25099682807922363, -0.12901075184345245, -0.029290225356817245], [0.06589639186859131, -0.4517573416233063, 0.004543880932033062, 0.24308989942073822, 0.343100368976593, -0.3916407525539398, 0.07654287666082382, -0.09253142774105072, 0.48627302050590515, -0.9053809642791748, -0.3570377826690674, -0.1838277131319046, 0.2848278880119324, -0.10047216713428497, 0.014467882923781872, -1.0692448616027832, -0.10204244405031204, -0.3503788709640503, -0.23019078373908997, -0.5246553421020508, 0.04988052695989609, 0.18196605145931244, -0.025222284719347954, -0.07716893404722214, -0.8162387013435364, -0.1772671341896057, -0.02018875442445278, -0.017818162217736244, 0.33327555656433105, 0.00345609406940639, 0.03353985399007797, 0.13697662949562073, 0.24125033617019653, 0.04803457111120224, -0.09250351041555405, 0.019727271050214767, 0.01917150989174843, -0.1662348210811615, 0.25779205560684204, -0.005992426536977291, -0.003318860661238432, -0.017734482884407043, 0.2632924020290375, -0.07194386422634125, -0.48435738682746887, -0.15994489192962646, 0.02418476529419422, 0.13837537169456482, -0.06031608581542969, -0.18449944257736206, -0.10439787805080414, -0.3639410734176636, 0.047163937240839005, 0.02055910974740982, 0.01642051339149475, 0.17550157010555267, -0.043369561433792114, -0.1632673591375351, 0.2758283317089081, -0.04505503922700882, 0.16192103922367096, 0.07781986892223358, -0.0639912560582161, 0.34884771704673767, -0.15200109779834747, 0.09524711221456528, 0.0022714207880198956, -0.12050504237413406, -0.389383465051651, -0.16170239448547363, -0.14398759603500366, 0.14951282739639282, 0.023868905380368233, -0.0026900810189545155, 0.34827491641044617, 0.0589396171271801, -0.3064521551132202, 0.1544618457555771, 0.029918109998106956, -0.11990031599998474, -0.5749761462211609, 0.004244259558618069, -0.3617669343948364, 0.1314781755208969, 0.10897960513830185, -0.5375373363494873, -0.19953230023384094, 0.20641058683395386, -0.19645975530147552, 0.043214112520217896, 0.19078105688095093, 0.20761163532733917, 0.2615484893321991, -0.008247570134699345, -0.47785764932632446, 0.12237948924303055, -0.009866807609796524, -0.16144247353076935, 0.5061336159706116, -0.27165651321411133, 0.0968281552195549, -0.25048914551734924, -0.12244954705238342, 0.2362198829650879, -0.33401039242744446, -0.031311921775341034, 0.0870470479130745, -0.11871819943189621, 0.08549061417579651, 0.02247060462832451, 0.09888720512390137, -0.03984717279672623, 0.23185253143310547, -0.09934023767709732, -0.31953898072242737, -0.014479291625320911, 0.08417225629091263, -0.011953214183449745, -0.6241961717605591, -0.4943734407424927, -0.05699726194143295, -0.03408850356936455, -0.04992162808775902, 0.2807333171367645, -0.13371428847312927, 0.4309956729412079, -0.25915780663490295, -0.8652979135513306], [0.0046798959374427795, -0.41313546895980835, 0.18200886249542236, 0.15093931555747986, 0.522948682308197, -0.19444435834884644, -0.15109360218048096, -0.2105102390050888, 0.1418898105621338, -0.27709731459617615, -0.19866229593753815, -0.1254267543554306, -0.4458768963813782, -0.05728187412023544, 0.3755750060081482, -1.0634430646896362, -0.3744850754737854, 0.263851135969162, 0.03346789628267288, -0.21992893517017365, -0.028369244188070297, 0.04767366871237755, 0.11421103030443192, 0.1218172088265419, -1.083340048789978, 0.003732816083356738, 0.06350182741880417, -0.06424647569656372, -0.2769170105457306, 0.15127277374267578, -0.30941978096961975, 0.6149675250053406, 0.35980546474456787, 0.021345287561416626, 0.012755785137414932, -0.008021076209843159, 0.0888897106051445, 0.10603240877389908, 0.3170912265777588, -0.11546143144369125, -0.2526989281177521, 0.1157526969909668, 0.3326908051967621, -0.3023720383644104, -0.5631316304206848, -0.24301056563854218, -0.23744650185108185, 0.321762353181839, -0.3578735291957855, -0.09572426974773407, -0.3336970806121826, -0.0948224738240242, 0.00020581067656166852, -0.23044413328170776, 0.1533096432685852, 0.5116068124771118, 0.5016470551490784, 0.15856462717056274, -0.3284103572368622, -0.35183295607566833, 0.4017137587070465, -0.1745654046535492, -0.34465864300727844, 0.6369714140892029, -0.4450426697731018, -0.1006111353635788, -0.09169764816761017, 0.12815669178962708, -0.25996822118759155, 0.10574911534786224, -0.19862860441207886, -0.20283447206020355, 0.5255287289619446, -0.1961859166622162, 0.41980281472206116, -0.46370816230773926, -0.1641845852136612, -0.7987095713615417, -0.2950313985347748, -0.14118507504463196, -0.9578152894973755, 0.1942034512758255, -0.24802528321743011, 0.24043461680412292, 0.23625987768173218, -0.36444422602653503, -0.04079693183302879, -0.10031838715076447, -0.3993978500366211, -0.005795549135655165, 0.3999761939048767, 0.051327966153621674, 0.7121850848197937, 0.06387131661176682, -0.5319374799728394, 0.45530441403388977, -0.10566044598817825, 0.013272271491587162, 0.29692527651786804, -0.5879009962081909, 0.11066076904535294, -0.07821633666753769, -0.20655536651611328, -0.06830336153507233, -0.0037150380667299032, -0.020122481510043144, -0.027682824060320854, -0.42959797382354736, -0.09583093971014023, -0.28323569893836975, 0.14085520803928375, 0.07093784958124161, 0.35503920912742615, -0.050228480249643326, -0.36535072326660156, 0.2283162772655487, -0.13669434189796448, -0.01010011788457632, 0.0016357178101316094, -0.16437683999538422, -0.03901071473956108, 0.07620224356651306, -0.011584388092160225, 0.3617488741874695, -0.21577037870883942, 0.07251761853694916, -0.31234410405158997, -0.10661403834819794], [0.07503538578748703, -0.03473951295018196, -0.14351604878902435, -0.1464495062828064, 0.12763671576976776, -0.29987016320228577, 0.41988950967788696, 0.10646931827068329, 0.29765668511390686, -0.4524601101875305, -0.47509855031967163, -0.0475894957780838, -0.14178606867790222, -0.020623017102479935, 0.12086789309978485, -0.5366034507751465, -0.06788840144872665, 0.26507818698883057, 0.0048372759483754635, 0.21050210297107697, 