{"class_name": "Sequential", "config": {"name": "sequential", "layers": [{"class_name": "Flatten", "config": {"name": "flatten", "batch_input_shape": [null, 28, 28], "dtype": "float32", "data_format": "channels_last"}}, {"class_name": "Dense", "config": {"name": "dense", "dtype": "float32", "units": 128, "activation": "relu", "use_bias": true}, "kernel_values": [[-0.058614831417798996, 0.07052009552717209, 0.019562549889087677, -0.04060141742229462, 0.022306226193904877, -0.05954187363386154, 0.040240392088890076, -0.061149001121520996, -0.03864244744181633, -0.06576698273420334, 0.03344322741031647, 0.012545570731163025, 0.013454489409923553, -0.004018321633338928, 0.033055536448955536, 0.03203273564577103, -0.024710673838853836, 0.056214042007923126, 0.049413226544857025, 0.03537645936012268, -0.014579936861991882, -0.035613372921943665, 0.022141195833683014, 0.07030042260885239, 0.06002751737833023, -0.050857774913311005, 0.06413543969392776, 0.027795322239398956, -0.024139825254678726, 0.07243848592042923, 0.06614824384450912, 0.008042529225349426, 0.0675777718424797, 0.018913574516773224, -0.04675329849123955, -0.03652200475335121, -0.01873202621936798, -0.029688913375139236, 0.022946827113628387, 0.022207193076610565, -0.028671234846115112, 0.027748271822929382, 0.06826775521039963, -0.056151267141103745, 0.03545926511287689, 0.026646554470062256, -0.06297368556261063, 0.021469630300998688, 0.029417268931865692, 0.04631807655096054, -0.07039131224155426, 0.07696656137704849, 0.05329781025648117, -0.0735154002904892, 0.0635962262749672, -0.05234276503324509, 0.057090915739536285, 0.07021047919988632, -0.052612222731113434, 0.049267448484897614, 0.004246056079864502, 0.07050519436597824, 0.06948322802782059, 0.014817312359809875, 0.07768028229475021, -0.05819764733314514, -0.037740450352430344, 0.0030480623245239258, 0.06645037978887558, -0.026246480643749237, -0.07659606635570526, 0.020216278731822968, 0.033921852707862854, 0.00956515222787857, -0.022730432450771332, 0.03613404184579849, 0.04890165477991104, 0.0003637745976448059, 0.011134006083011627, -0.07748636603355408, -0.06659342348575592, -0.07304048538208008, 0.07597848027944565, -0.07660285383462906, -0.0283227376639843, 0.06389836221933365, 0.06360285729169846, -0.07939837872982025, 0.00924304872751236, -0.05275619775056839, 0.0554385706782341, 0.010817654430866241, -0.05669763311743736, 0.014319665729999542, 0.048108674585819244, 0.029514014720916748, -0.06396407634019852, -0.045833103358745575, 0.046108610928058624, -0.05749106407165527, 0.07501154392957687, -0.0019241198897361755, 0.013482160866260529, -0.07091878354549408, 0.028763093054294586, -0.029328543692827225, 0.043804459273815155, -0.06016609072685242, -0.05233195424079895, 0.02799895405769348, -0.06194552779197693, 0.02978774905204773, 0.021394290030002594, 0.06410025805234909, 0.0499606654047966, 0.061104096472263336, 0.010374434292316437, 0.04447849839925766, 0.007725439965724945, -0.0777120441198349, 0.07136821001768112, -0.02304672822356224, -0.03656688705086708, -0.02811582013964653, -0.03657897561788559, -0.02798553556203842, -0.08092612773180008, 0.024063706398010254], [0.04806479066610336, -0.05156269669532776, 0.07137345522642136, 0.04401087015867233, -0.006596505641937256, -0.06212923675775528, -0.028631996363401413, 0.012098178267478943, 0.015616163611412048, 0.07084722071886063, -0.048710353672504425, -0.047488387674093246, 0.026449166238307953, 0.0800110325217247, -0.0376555360853672, -0.050677619874477386, 0.0592423751950264, 0.0010790154337882996, 0.058696307241916656, 0.07310681790113449, 0.07391320914030075, 0.041936226189136505, -0.0018324553966522217, -0.058936022222042084, -0.06656668335199356, 0.023813024163246155, -0.05112744867801666, 0.009198032319545746, 0.04494752734899521, -0.07006175071001053, -0.04514935985207558, -0.0071051642298698425, -0.00730258971452713, -0.04276185482740402, 0.03904091566801071, -0.06374792754650116, 0.04605657607316971, -0.017488613724708557, -0.015053220093250275, 0.07086171954870224, -0.030860930681228638, -0.017769329249858856, 0.028805769979953766, 0.041230589151382446, 0.01616600900888443, 0.04348909109830856, 0.011562004685401917, 0.02901628613471985, -0.05758305639028549, 0.018444694578647614, 0.047887541353702545, -0.06362996995449066, -0.013638876378536224, 0.005357325077056885, -0.03583506867289543, -0.005747437477111816, 0.022086448967456818, 0.07267255336046219, -0.04371444135904312, 0.00677645206451416, 0.03785363584756851, -0.05277880281209946, -0.04819324612617493, -0.05375029891729355, 0.0037001892924308777, -0.07280411571264267, 0.02851809561252594, -0.008074186742305756, 0.049133606255054474, -0.03412507846951485, -0.0004975199699401855, -0.038470104336738586, -0.057060010731220245, -0.06468649953603745, 0.03855472803115845, -0.011690102517604828, 0.04428301006555557, -0.03368039429187775, -0.07274254411458969, 0.04051396995782852, -0.07306282222270966, 0.012552507221698761, 0.023993685841560364, -0.016219362616539, 0.005010224878787994, 0.021465688943862915, -0.02227594330906868, -0.028252985328435898, -0.028758931905031204, -0.044452060014009476, -0.06115389242768288, -0.043288689106702805, 0.014253757894039154, 0.04990822821855545, -0.04139258712530136, 0.03293004631996155, -0.04985400289297104, -0.06919858604669571, 0.004781953990459442, 0.04077153652906418, -0.03851315379142761, -0.006069250404834747, -0.028539810329675674, -0.0019997358322143555, 0.073552705347538, -0.03059135377407074, 0.03941487520933151, -0.038593366742134094, -0.02557723969221115, 0.07134013622999191, -0.00979817658662796, -0.0042632222175598145, -0.04662982374429703, 0.0591852143406868, -0.05873088166117668, -0.02919938415288925, -0.05750030651688576, -0.07820916920900345, -0.022251944988965988, -0.028554700314998627, 0.021645143628120422, 0.03801426291465759, 0.018476739525794983, -0.07350843399763107, -0.08006638288497925, -0.04803869500756264, 0.02752702683210373, -0.061737582087516785], [0.05765662342309952, 0.0170314759016037, 0.0522010400891304, 0.07750574499368668, -0.009940482676029205, 0.042955122888088226, -0.0064244940876960754, 0.0021312907338142395, 0.005470454692840576, -0.07917873561382294, 0.000749535858631134, 0.024647921323776245, 0.006052285432815552, -0.07940723747015, 0.07650815695524216, 0.01575162261724472, 0.050748519599437714, -0.013975515961647034, 0.04888267070055008, 0.059020571410655975, -0.043193697929382324, 0.06768464297056198, 0.007270365953445435, 0.037744417786598206, -0.0327003113925457, -0.012964919209480286, 0.023665420711040497, 0.023404739797115326, -0.004085756838321686, -0.02280619740486145, 0.08071590214967728, -0.0752875804901123, 0.0038069412112236023, -0.04054858535528183, -0.011334121227264404, -0.05094195529818535, -0.04239388555288315, -0.07437700033187866, 0.027431033551692963, -0.08001826703548431, -0.009619258344173431, 0.08037944883108139, -0.0610712394118309, -0.03230103477835655, 0.04836278408765793, -0.04552421346306801, 0.04658951610326767, -0.029510244727134705, 0.02448803186416626, -0.0657997652888298, -0.04064521938562393, 0.05601229518651962, 0.006962791085243225, -0.017384745180606842, -0.054747190326452255, -0.04838330298662186, -0.028613045811653137, -0.07982762902975082, -0.07855495810508728, -0.06909870356321335, 0.031262002885341644, 0.008547723293304443, 0.021368011832237244, -0.038190241903066635, -0.061170950531959534, -0.04880060628056526, 0.03822201490402222, 0.032287612557411194, -0.06697715818881989, -0.01469055563211441, 0.012573257088661194, 0.0749199166893959, -0.052480995655059814, 0.03418686240911484, 0.06766556948423386, -0.0037634819746017456, 0.05682625621557236, -0.02903253212571144, -0.03456136956810951, -0.02028423175215721, 0.07448006421327591, -0.03994505852460861, -0.016075775027275085, -0.07502488791942596, 0.042420223355293274, -0.03729124367237091, 0.00045023113489151, -0.016696743667125702, -0.062067531049251556, -0.062404826283454895, 0.05153130739927292, 0.0033729076385498047, -0.07919704914093018, -0.07132365554571152, -0.0014951974153518677, -0.028925534337759018, 0.04851868003606796, 0.04953370243310928, -0.05472912639379501, 0.06102966517210007, -0.07104982435703278, -0.025492597371339798, 0.07133296877145767, -0.05961659550666809, 0.009990476071834564, -0.06723538041114807, -0.01940781995654106, -0.014899738132953644, 0.00423227995634079, -0.059890907257795334, -0.004945650696754456, -0.003254018723964691, -0.013643905520439148, 0.009129762649536133, 0.015256330370903015, -0.0389164537191391, -0.0057890936732292175, 0.055586494505405426, 0.06586510688066483, -0.01735856384038925, -0.02622799575328827, -0.07628355920314789, 0.0196080282330513, -0.001602374017238617, -0.02889169007539749, 0.01847352832555771, -0.005239963531494141, 0.08045489341020584], [0.04031755030155182, 0.0015382841229438782, 0.0045127272605896, 0.06522103399038315, 0.018161579966545105, -0.02333015203475952, 0.06507376581430435, -0.0031123459339141846, 0.07042499631643295, 0.00839688628911972, -0.03439289703965187, -0.04373607784509659, 0.04142904281616211, -0.030965067446231842, -0.061794571578502655, -0.07472235709428787, -0.01270553469657898, 0.07013050466775894, -0.07253411412239075, 0.07989531010389328, 0.06310365349054337, 0.005744189023971558, -0.0006350502371788025, -0.05586196482181549, -0.06220262497663498, -0.07079409062862396, -0.04762234166264534, -0.026752468198537827, -0.0007871240377426147, 0.04513207823038101, 0.02800125628709793, 0.034361280500888824, 0.08051609247922897, -0.058814637362957, -0.03839528560638428, -0.06165388226509094, 0.014202333986759186, 0.05063688009977341, 0.0484749898314476, -0.07551101595163345, -0.01723429560661316, -0.053807951509952545, -0.026461485773324966, 0.04547540098428726, 0.006542690098285675, 0.055323220789432526, -0.04004702717065811, 0.044859208166599274, 0.00042675435543060303, -0.0037110373377799988, -0.06252549588680267, 0.042311906814575195, -0.026430640369653702, 0.03366697579622269, 0.011712223291397095, -0.024858709424734116, -0.03510785102844238, -0.0763321965932846, 0.05341570824384689, -0.06034129858016968, 0.040840379893779755, -0.06083846464753151, 0.030577778816223145, -0.02754170447587967, -0.06178048998117447, -0.02893522009253502, 0.017749562859535217, -0.03416255861520767, -0.05528835207223892, 0.07749294489622116, 0.05333320051431656, 0.019034303724765778, -0.06126481667160988, 0.05925147980451584, 0.012397535145282745, -0.06830869615077972, 0.004871547222137451, 0.017318181693553925, 0.014927521347999573, -0.0713726356625557, 0.03705521672964096, -0.07676179707050323, 0.08106187731027603, -0.020913656800985336, 0.06151401251554489, 0.025958634912967682, 0.0716523602604866, 0.0599406436085701, 0.04436846822500229, 0.06866591423749924, -0.03224203363060951, -0.040457192808389664, 0.01954866200685501, -0.036392416805028915, -0.07229288667440414, -0.06094014644622803, -0.061220280826091766, 0.02125592529773712, -0.007372573018074036, -0.04541425779461861, -0.02907528728246689, 0.04873894900083542, -0.07060200721025467, 0.06414831429719925, -0.06246717646718025, -0.06427207589149475, 0.05966944247484207, -0.057146668434143066, -0.07087703794240952, 0.06224042922258377, -0.05350866913795471, -0.02478228136897087, 0.042736075818538666, 0.04062104970216751, 0.019321128726005554, -0.015312373638153076, -0.038868919014930725, 0.057628728449344635, 0.03082573413848877, 0.03985041379928589, -0.03449612483382225, -0.04754893481731415, 0.07405825704336166, 0.07522789388895035, -0.02719440683722496, 0.010427519679069519, 0.02929135411977768, -0.04108251631259918], [0.010601818561553955, -0.056787148118019104, 0.042735010385513306, 0.0017054080963134766, -0.05053497850894928, -0.04106079787015915, 0.06890302151441574, -0.011189430952072144, 0.007146723568439484, -0.04143203794956207, 0.009965531527996063, -0.010969594120979309, 0.029756128787994385, -0.015802331268787384, 0.001176096498966217, 0.006942525506019592, -0.010768532752990723, -0.05117633566260338, -0.018754903227090836, -0.06127297878265381, -0.013939298689365387, 0.025805294513702393, -0.03435002267360687, 0.04782595485448837, 0.01273353397846222, -0.02164361998438835, 0.0038469135761260986, 0.020487770438194275, 0.039281077682971954, 0.00671551376581192, 0.020046837627887726, 0.021353445947170258, -0.043908461928367615, 0.049460701644420624, 0.03460673987865448, -0.003725387156009674, -0.03443099185824394, 0.050827883183956146, 0.017285406589508057, 0.0013202279806137085, -0.06139416992664337, 0.0326315239071846, 0.05701836198568344, -0.008621886372566223, -0.0762946754693985, 0.025421738624572754, 0.037531234323978424, 0.035920895636081696, -0.042231347411870956, 0.04609573632478714, 0.03631160408258438, -0.054289668798446655, 0.046100251376628876, -0.04352351278066635, 0.03424072265625, 0.051323048770427704, -0.04003642871975899, 0.004361502826213837, -0.024786867201328278, 0.07937712222337723, 0.014576748013496399, -0.05033399909734726, -0.023574084043502808, 0.030299268662929535, -0.05230085551738739, 0.027779370546340942, -0.05777914822101593, 0.008993260562419891, -0.011470086872577667, -0.05973823368549347, 0.07841140776872635, -0.03052191063761711, -0.02590767666697502, -0.06884618103504181, 0.019392579793930054, 0.07503614574670792, -0.07458467036485672, 0.020032525062561035, -0.02893581986427307, 0.07478626817464828, 0.015584133565425873, 0.04217253625392914, 0.015897922217845917, -0.053032368421554565, 0.06319139152765274, -0.027804318815469742, -0.054569143801927567, -0.0224686861038208, -0.04513971135020256, -0.03653683513402939, -0.07618818432092667, 0.025063730776309967, -0.005939200520515442, -0.0034425631165504456, 0.07725883275270462, 0.06758173555135727, -0.041778404265642166, 0.06630805879831314, -0.027635376900434494, 0.06248552352190018, -0.016233399510383606, 0.017421238124370575, -0.06039809435606003, -0.07742130756378174, -0.06349267065525055, -0.05001385137438774, 0.019107304513454437, -0.03782082349061966, 0.01502055674791336, -0.03295052796602249, -0.07437427341938019, 0.007934965193271637, -0.056955721229314804, 0.02838403731584549, -0.04057784378528595, 0.06149136275053024, 0.07129315286874771, 0.003569498658180237, -0.04634204879403114, -0.0034506097435951233, -0.05280984193086624, -0.010981656610965729, 0.06798059493303299, -0.07377412170171738, 0.038767799735069275, -0.019744209945201874, 0.025269299745559692, -0.05062921345233917], [-0.04619894549250603, 0.01631999760866165, -0.019946489483118057, 0.051844798028469086, 0.0042518749833106995, 0.056033648550510406, 0.06781292706727982, 0.03211279213428497, 0.04381082206964493, 0.07379140704870224, -0.04773794859647751, 0.06549569219350815, 0.018152840435504913, 0.07375942915678024, -0.05589006468653679, -0.02265528216958046, -0.03391692042350769, -0.06102824956178665, 0.006976604461669922, -0.04773123562335968, 0.013765908777713776, -0.05588677525520325, 0.006884142756462097, 0.018545567989349365, -0.018568694591522217, -0.030828654766082764, 0.04835238307714462, -0.05574272572994232, 0.0035538971424102783, -0.05330047383904457, -0.006928078830242157, -0.034504495561122894, 0.0075887516140937805, 0.07295530289411545, 0.04422979801893234, -0.027293052524328232, -0.06666182726621628, -0.07090381532907486, -0.04400026053190231, -0.00923863798379898, -0.008282922208309174, 0.024410255253314972, 0.00012212246656417847, -0.0640619695186615, -0.022068191319704056, 0.025900110602378845, 0.018176667392253876, 0.0002463683485984802, -6.582587957382202e-05, -0.003583192825317383, -0.04622901976108551, -0.04505317285656929, 0.05718477815389633, -0.052120141685009, -0.03895847499370575, 0.07483578473329544, -0.073399119079113, 0.07530643790960312, -0.05100607872009277, 0.01821652054786682, -0.023670949041843414, -0.07209917902946472, 0.07404608279466629, -0.0704379752278328, -0.07806001603603363, -0.01594839245080948, -0.015457332134246826, -0.06408964097499847, 0.00606285035610199, 0.05864567309617996, 0.03364957123994827, -0.0005124285817146301, -0.00843852013349533, 0.03723139315843582, -0.06144040822982788, -0.0462084598839283, 0.047162823379039764, 0.06895674020051956, 0.008746907114982605, -0.04978954792022705, 0.06739185005426407, 0.05016391724348068, -0.06081168353557587, -0.021412506699562073, -0.05228055268526077, 0.022696182131767273, 0.07535900920629501, -0.0634322315454483, -0.06697040796279907, -0.028027385473251343, -0.07655823975801468, 0.028610512614250183, -0.031058315187692642, 0.03932971507310867, 0.008515581488609314, -0.03469930961728096, -0.02965056523680687, -0.004612646996974945, 0.05161520093679428, -0.07594583183526993, 0.01681128889322281, -0.059178851544857025, -0.005721971392631531, -0.06086663901805878, -0.0532844215631485, -0.020989172160625458, 0.008600786328315735, 0.04951239377260208, -0.0010883212089538574, 0.04291284829378128, -0.019840285181999207, 0.07191329449415207, -0.07167895138263702, 0.02913479506969452, -0.014051303267478943, 0.014486551284790039, 0.02385997772216797, 0.028211817145347595, -0.042061980813741684, 8.159130811691284e-05, 0.041617780923843384, -0.03751659020781517, 0.07226935774087906, -0.038575150072574615, 0.0021151676774024963, 0.03481971472501755, -0.010307736694812775, -0.04220616817474365], [0.02932090312242508, -0.0035541504621505737, -0.06565575301647186, -0.0695248618721962, 0.07665015012025833, 0.04882846027612686, 0.05527079850435257, -0.048684846609830856, 0.06355948001146317, -0.06418059021234512, -0.07588808983564377, 0.014715462923049927, 0.054619185626506805, 0.022608697414398193, -0.002756170928478241, -0.07974683493375778, -0.010330013930797577, -0.03410252928733826, -0.025977175682783127, -0.06791682541370392, -0.07713450491428375, -0.011816106736660004, 0.06703726202249527, -0.050484199076890945, -0.061482179909944534, -0.07915647327899933, 0.05429445952177048, -0.006185777485370636, 0.028176233172416687, 0.030565790832042694, 0.006184101104736328, 0.03909989446401596, 0.025735467672348022, 0.0036490410566329956, 0.07195600122213364, 0.003463760018348694, -0.026580337435007095, -0.05555800721049309, 0.024726547300815582, -0.00011434406042098999, -0.03834626451134682, 0.004788301885128021, 0.030775107443332672, -0.004782572388648987, 0.01070278137922287, 0.03689652681350708, 0.022346220910549164, 0.011818833649158478, 0.0773455873131752, 0.0651480183005333, -0.04070686921477318, 0.04618886858224869, -0.026226293295621872, -0.05396530404686928, -0.07007938623428345, -0.010049477219581604, -0.0065059661865234375, 0.06031554192304611, 0.041499391198158264, 0.0014883950352668762, -0.006174296140670776, 0.07723943144083023, -0.04996585473418236, -0.007253929972648621, -0.07555963099002838, -0.0725962296128273, 0.01528438925743103, 0.065269835293293, 0.0655030831694603, 0.04180280864238739, 0.07928331941366196, -0.020345322787761688, 0.0036776214838027954, -0.010699860751628876, -0.06037728488445282, 0.04639851301908493, 0.07115533202886581, -0.07559606432914734, -0.04483499750494957, -0.04882408306002617, 0.0599239245057106, 0.006946392357349396, 0.04769193381071091, -0.0671720877289772, 0.07270678132772446, 0.06316567212343216, 0.07025743275880814, -0.08001267910003662, -0.01705116033554077, 0.031303875148296356, 0.06256338208913803, 0.003590621054172516, 0.07275056093931198, 0.02496466040611267, 0.004914268851280212, 0.05668646842241287, -0.07753165066242218, -0.00804370641708374, 0.040859371423721313, 0.032372452318668365, -0.0033831968903541565, -0.010088250041007996, -0.0029591843485832214, -0.061269596219062805, 0.0209956094622612, 0.011758245527744293, 0.06937483698129654, 0.06749752908945084, 0.034520529210567474, 0.028832748532295227, 0.02129073441028595, 0.014832399785518646, 0.02696777880191803, 0.05380614846944809, -0.027543462812900543, -0.04690951481461525, 0.035291627049446106, -0.03135668486356735, 0.05889446288347244, -0.06525623798370361, -0.03380182012915611, -0.015650488436222076, 0.05227046459913254, -0.030192770063877106, -0.003486134111881256, 0.010916337370872498, 0.007014445960521698, 0.07263537496328354], [-0.03521117568016052, -0.006425708532333374, -0.03559138625860214, 0.06345672160387039, -0.011466778814792633, 0.0549408420920372, 0.07756344228982925, 0.06118280440568924, -0.04923798143863678, 0.004341676831245422, 0.06060037761926651, -0.0795975998044014, 0.029275596141815186, -0.07713049650192261, -0.01477765291929245, -0.0796651691198349, 0.07316567748785019, 0.06873207539319992, -0.04176393896341324, 0.043229587376117706, 0.04901682585477829, 0.05137486010789871, -0.0447218120098114, 0.051041312515735626, -0.006110146641731262, 0.034007154405117035, 0.07579509168863297, -0.0214097797870636, -0.017802663147449493, -0.06964422017335892, -0.06843387335538864, -0.013175606727600098, 1.4349818229675293e-05, 0.06609141081571579, 0.06293297559022903, -0.054445572197437286, 0.03682973235845566, 0.06881367415189743, -0.01573837548494339, 0.058662377297878265, 0.01505204290151596, 0.06555909663438797, -0.0632370337843895, -0.03890366852283478, 0.03982030600309372, 0.02716793119907379, 0.002147592604160309, -0.0772147923707962, -0.04007253423333168, -0.03875789791345596, -0.00880201905965805, -0.04815195873379707, 0.05307423323392868, 0.08030890673398972, -0.047510527074337006, -0.0669553279876709, -0.020069867372512817, 0.07820054143667221, 0.06465787440538406, -0.07630255073308945, 0.028617165982723236, 0.00721527636051178, 0.011107437312602997, -0.02494950219988823, 0.003835037350654602, 0.0308699831366539, 0.022491566836833954, 0.007638201117515564, 0.036376580595970154, 0.039524972438812256, 0.007786914706230164, -0.042860809713602066, 0.06317897886037827, 0.059106506407260895, -0.020025331526994705, 0.060113124549388885, -0.06610772758722305, 0.024527229368686676, -0.006715066730976105, -0.07016465067863464, -0.0556233711540699, 0.035544201731681824, 0.015583671629428864, -0.029127810150384903, 0.041076600551605225, 0.045079149305820465, -0.01922379806637764, 0.059549666941165924, -0.050434961915016174, -0.017781004309654236, -0.053808875381946564, -0.0034051090478897095, 0.020270563662052155, -0.054320551455020905, 0.061040498316287994, -0.05954701453447342, -0.0117262601852417, -0.03841155022382736, 0.000734277069568634, -0.039086222648620605, 0.0180906280875206, -0.031248334795236588, -0.050873227417469025, -0.043260686099529266, 0.06869319826364517, -0.05468544363975525, -0.06750404834747314, 0.01749340444803238, 0.05976741760969162, -0.005077950656414032, -0.061253175139427185, 0.0561084970831871, -0.019608918577432632, -0.05098249018192291, 0.02346433699131012, -0.06826872378587723, -0.011876247823238373, -0.061374232172966, -0.04580417647957802, -0.075025774538517, 0.07312924414873123, 0.0528857484459877, -0.03610818460583687, -0.060773931443691254, -0.04388970136642456, -0.06255313754081726, 0.07103448361158371, 0.05750439316034317], [-0.009369350969791412, -0.06002546474337578, 0.014543481171131134, -0.04380502179265022, -0.023923467844724655, -0.027436580508947372, -0.07853277772665024, 0.009694099426269531, 0.04008118063211441, 0.001586727797985077, -0.0758965015411377, -0.04776914045214653, -0.03532552346587181, 0.04982597380876541, -0.07669519633054733, -0.03665882349014282, 0.05509846657514572, -0.02418430522084236, 0.014361992478370667, -0.018777355551719666, 0.07842911034822464, 0.009468071162700653, 0.009420476853847504, 0.03328446298837662, 0.057079486548900604, -0.014659978449344635, -0.07907146215438843, 0.015354573726654053, -0.0764649361371994, -0.06998403370380402, -0.022585276514291763, 0.05692223459482193, 0.009574703872203827, -0.03204714134335518, -0.000737212598323822, 0.0589979812502861, 0.002119012176990509, -0.053279899060726166, -0.056434594094753265, 0.030726991593837738, 0.017380356788635254, 0.007647097110748291, -0.07130967080593109, -0.015615448355674744, -0.039200473576784134, 0.06352118402719498, -0.05046015977859497, 0.06206589192152023, 0.040870584547519684, 0.0770011618733406, 0.008228309452533722, -0.07870098203420639, -0.050360336899757385, 0.07941419631242752, 0.00994410365819931, -0.053042247891426086, -0.05319070816040039, -0.030257031321525574, 0.05065543204545975, -0.009229861199855804, 0.03231797367334366, -0.030965741723775864, -0.01832398772239685, 0.054069988429546356, 0.045822255313396454, 0.03970574587583542, -0.04419965669512749, 0.06460846215486526, -0.061817388981580734, 0.06855643540620804, 0.05748576670885086, 0.06392627209424973, -0.03482711687684059, 0.007830984890460968, 0.05831300467252731, -0.015881620347499847, -0.05993078276515007, -0.004732295870780945, -0.05444866418838501, -0.01566653698682785, -0.0015221983194351196, -0.0643695816397667, 0.07006221264600754, 0.06037987023591995, -0.06948429346084595, -0.0252765491604805, 0.00819290429353714, 0.05556590110063553, 0.047216109931468964, -0.00047266483306884766, 0.020458877086639404, 0.048238493502140045, -0.007731296122074127, -0.02972836047410965, 0.019760124385356903, 0.05825554579496384, 0.009491220116615295, -0.0013042539358139038, -0.03083561360836029, -0.051281146705150604, 0.004056036472320557, -0.023662537336349487, -0.006863489747047424, 0.022862762212753296, -0.06455919146537781, 0.054922573268413544, 0.03697894513607025, -0.03562609851360321, -0.04238440841436386, -0.025850780308246613, 0.032050952315330505, -0.052156150341033936, 0.022813335061073303, 0.025380320847034454, 0.06587343662977219, 0.008628055453300476, -0.04311145097017288, -0.02894790843129158, 0.05033094435930252, -0.0758332684636116, 0.08011051267385483, 0.024131223559379578, -0.07419117540121078, -0.07390253245830536, 0.07441646605730057, -0.054723192006349564, 0.05240882188081741, -0.07091739773750305], [0.039570726454257965, 0.04431641846895218, -0.0009811297059059143, 0.02616678923368454, -0.005619712173938751, 0.0032182037830352783, 0.014287404716014862, 0.07555650919675827, 0.03165668249130249, 0.011210411787033081, 0.04322546720504761, 0.05087966471910477, -0.05927761271595955, -0.07488557696342468, 0.03826581686735153, 0.0779263898730278, 0.036944739520549774, 0.033172011375427246, -0.018739275634288788, -0.032039426267147064, 0.019110478460788727, 0.017287589609622955, 0.016928672790527344, -0.04082842916250229, -0.039188213646411896, 0.07757452875375748, 0.015615195035934448, -0.001714959740638733, -0.07225744426250458, 0.07003609091043472, 0.05653693526983261, 0.0014652982354164124, -0.060402482748031616, 0.031421951949596405, -0.07154230773448944, 0.03348579257726669, 0.04521157592535019, -0.03406716138124466, 0.00013430416584014893, -0.06246037036180496, 0.02132430672645569, 0.06062202900648117, 0.05867614597082138, -0.045503851026296616, -0.05322454869747162, -0.002903565764427185, -0.027659878134727478, 0.04385893791913986, -0.05248694866895676, 0.012340210378170013, 0.04165209084749222, 0.007570631802082062, 0.03970617055892944, 0.035148367285728455, 0.06528633087873459, 0.010979786515235901, -0.0077588558197021484, 0.07775377482175827, 0.07590871304273605, -0.016779594123363495, 0.02182818204164505, -0.044589750468730927, -0.07722560316324234, -0.0008629336953163147, 0.029091261327266693, 0.07813744992017746, 0.07326460629701614, -0.04932038113474846, 0.03988129645586014, 0.05367105454206467, -0.03552998602390289, 0.030128762125968933, 0.001991845667362213, -0.05920290946960449, -0.05740965157747269, -0.07485515624284744, -0.02258266881108284, -0.04807431623339653, 0.006387151777744293, -0.0475347600877285, -0.05648088827729225, 0.008457042276859283, -0.07035830616950989, -0.0364711619913578, -0.015097543597221375, -0.06854920834302902, 0.027793623507022858, 0.0030178800225257874, 0.06349421292543411, 0.07717790454626083, -0.06691674143075943, 0.013187363743782043, -0.06464619934558868, 0.0750943049788475, 0.0172470360994339, -0.02721426635980606, -0.030872978270053864, 0.03785843402147293, 0.026141822338104248, 0.003611929714679718, -0.0019019395112991333, 0.08107609301805496, 0.06875839084386826, 0.02157779037952423, 0.026564210653305054, 0.06609044224023819, -0.07787440717220306, 0.062319450080394745, 0.0313880518078804, -0.00349242240190506, -0.008243739604949951, -0.07721713185310364, -0.02797161415219307, -0.03877627104520798, 0.06635626405477524, -0.04117975011467934, -0.020101871341466904, 0.012780971825122833, 0.029023192822933197, -0.07765457034111023, -0.06620322167873383, -0.003046378493309021, 0.0746251717209816, -0.04670528322458267, 0.0017930865287780762, -0.017408937215805054, 0.0806724801659584, 0.008497826755046844], [0.06561128050088882, -0.07835368812084198, -0.016486652195453644, -0.056814029812812805, 0.018785879015922546, 0.056117720901966095, 0.023061640560626984, 0.01355259120464325, -0.03424913436174393, -0.07887916266918182, -0.016052432358264923, 0.026138439774513245, 0.07508068531751633, 0.023281939327716827, 0.013733267784118652, 0.03721292316913605, 0.04903639107942581, -0.06628028303384781, -0.07837062329053879, 0.0640653744339943, -0.0016150549054145813, 0.02231040596961975, -0.06855697929859161, 0.010594449937343597, -0.021562609821558, 0.05431174486875534, -0.021352287381887436, -0.0046296268701553345, -0.01305435597896576, 0.013366863131523132, -0.04549787566065788, 0.03405679762363434, 0.004604123532772064, 0.07191770523786545, -0.049160104244947433, -0.051004089415073395, 0.07456233352422714, 0.009278826415538788, 0.02777031809091568, 0.01036941260099411, -0.02553579956293106, -0.017560429871082306, -0.04858867824077606, 0.029590129852294922, -0.03470315784215927, 0.011976383626461029, 0.06193888932466507, 0.058903686702251434, 0.04243636876344681, -0.07141831517219543, 0.024980656802654266, 0.07760468870401382, -0.052943065762519836, -0.009287603199481964, -0.04927004128694534, -0.00690431147813797, 0.0747135654091835, -0.00597439706325531, -0.007294796407222748, 0.04054071754217148, 0.056518636643886566, 0.03339453786611557, 0.04429774731397629, 0.03695181757211685, -0.03307560831308365, -0.04311655834317207, -0.06979437917470932, -0.05051665008068085, -0.061505790799856186, -0.009851567447185516, 0.0368330180644989, -0.013805769383907318, -0.017426416277885437, -0.005933299660682678, 0.07925891131162643, 0.02677849680185318, 0.005982920527458191, 0.06604675203561783, 0.06510131806135178, -0.06454258412122726, -0.06270463019609451, 0.013703778386116028, 0.07508230954408646, -0.0338473804295063, -0.020485389977693558, 0.04481271654367447, -0.02643878385424614, 0.03838629275560379, 0.07188963145017624, -0.06720323860645294, -0.037665922194719315, 0.05080241709947586, -0.02548704668879509, -0.0549478642642498, 0.04856937378644943, -0.04659797251224518, -0.00022213906049728394, -0.005281426012516022, 0.03785756230354309, -0.05527452751994133, -0.07473593205213547, -0.031754184514284134, -0.06975764036178589, 0.031417444348335266, -0.0699993297457695, -0.013912610709667206, 0.030081845819950104, 0.0172194242477417, 0.035118117928504944, 0.07618334144353867, -0.07956261932849884, -0.0552436038851738, -0.011631019413471222, 0.020951561629772186, 0.015631169080734253, 0.04889660328626633, -0.01986975595355034, -0.06997606158256531, -0.01524370163679123, -0.011998005211353302, 0.003912702202796936, 0.007563188672065735, -0.05595090240240097, -0.024242203682661057, 0.025750569999217987, -0.02609635889530182, -0.0010331273078918457, 0.04548824578523636], [0.00792798399925232, 0.009414926171302795, -0.03296807035803795, 0.017579421401023865, -0.004652157425880432, 0.06316586583852768, -0.03422480821609497, 0.030136093497276306, 0.02236851304769516, -0.05033639818429947, 0.053843431174755096, -0.0208987258374691, 0.0017506182193756104, -0.05697210133075714, 0.04872559756040573, -0.0778520479798317, 0.0638582780957222, 0.01911316066980362, 0.047781966626644135, 0.052158258855342865, -0.0034808143973350525, -0.04179811105132103, 0.027895033359527588, 0.03844337910413742, 0.06232527643442154, -0.0725497230887413, 0.01383955031633377, -0.061248570680618286, 0.04619457572698593, -0.03125989809632301, 0.025913633406162262, 0.03323116898536682, -0.003311954438686371, 0.05532359331846237, 0.019138649106025696, -0.008759550750255585, 0.043750159442424774, -0.07673513144254684, 0.03981129080057144, 0.02591438591480255, -0.010864101350307465, -0.07452085614204407, -0.007184542715549469, 0.039239250123500824, -0.00738651305437088, 0.08106385916471481, -0.028139084577560425, 0.011604510247707367, -0.05943703651428223, 0.05710370093584061, 0.017296388745307922, -0.07791387289762497, 0.03243477642536163, 0.034007638692855835, 0.028614960610866547, 0.039835602045059204, -0.0715460255742073, 0.05466441065073013, -0.05809023976325989, -0.02562607079744339, 0.029790982604026794, 0.030403807759284973, -0.06354383379220963, -0.04051878675818443, 0.02556198090314865, 0.05566520243883133, 0.012255437672138214, 0.06656388193368912, 0.06736467033624649, -0.028509777039289474, 0.062414415180683136, -0.08068356662988663, -0.07067349553108215, 0.04935642331838608, -0.07373709231615067, -0.012084834277629852, -0.047305021435022354, 0.04857867211103439, 0.011564880609512329, -0.02339499071240425, 0.07111018151044846, -0.0626961812376976, -0.07996812462806702, -0.06243091821670532, -0.05015326291322708, 0.0003389418125152588, 0.048954419791698456, 0.03824790567159653, 0.04491127282381058, 0.018220625817775726, -0.04458802938461304, -0.022820256650447845, 0.05970657616853714, 0.003603734076023102, -0.04441603273153305, 0.053222425282001495, 0.06280270963907242, -0.0018418356776237488, -0.06760606169700623, -0.017909914255142212, -0.07908418774604797, 0.018187634646892548, 0.059353627264499664, -0.0659102275967598, -0.06063578277826309, 0.012318827211856842, 0.04838164895772934, -0.048097096383571625, -0.06171894073486328, -0.001721300184726715, 0.014135889708995819, 0.05498219281435013, 0.00292167067527771, 0.04639836400747299, -0.059319887310266495, -0.01969487965106964, -0.0017583966255187988, -0.023207005113363266, -0.06401669979095459, -0.02919866517186165, 0.04832633584737778, 0.02798917144536972, 0.0351283922791481, -0.05762917548418045, -0.017516031861305237, -0.056621845811605453, -0.05808403342962265, 0.06894918531179428], [0.011821329593658447, 0.014153219759464264, 0.008708369918167591, -0.07177577167749405, -0.0005455911159515381, 0.13871213793754578, 0.040167950093746185, -0.031930070370435715, 0.029911700636148453, -0.05020800977945328, -0.007932815700769424, 0.11613237857818604, -0.07936134934425354, 0.042683832347393036, -0.022188277915120125, -0.007504334673285484, -0.018389573320746422, 0.10337590426206589, 0.0005384013056755066, 0.03436000272631645, 0.10070672631263733, -0.028406154364347458, 0.027002306655049324, -0.08248000591993332, 0.073640838265419, -0.07807642221450806, -0.03588606417179108, 0.010665945708751678, -0.09593434631824493, 0.012306056916713715, 0.09522625803947449, 0.08095655590295792, -0.039998896420001984, -0.06664624065160751, -0.08879609405994415, -0.010964292101562023, -0.10217076539993286, 0.07877225428819656, -0.010553047060966492, 0.06102383881807327, 0.09909672290086746, 0.020757846534252167, 0.07243908196687698, -0.01493595540523529, -0.0864080861210823, 0.046488936990499496, 0.0699768140912056, 0.03252727538347244, 0.0754062607884407, 0.009542089886963367, 0.03574143722653389, 0.1174209788441658, -0.03774343430995941, 0.13457421958446503, -0.03506758064031601, -0.02001907490193844, -0.0544675812125206, -0.07564576715230942, -0.002374735428020358, 0.0885525494813919, -0.014230518601834774, -0.043667081743478775, 0.024053869768977165, 0.09673743695020676, 0.07507316023111343, -0.08705361932516098, 0.11678484082221985, 0.08831463009119034, 0.066337451338768, 0.0297824889421463, -0.06576996296644211, 0.06629844754934311, -0.009163073264062405, 0.01971178688108921, 0.02266693115234375, 0.03628690168261528, 0.04952511563897133, 0.05520573630928993, -0.034164756536483765, 0.1206706166267395, 0.11226769536733627, 0.012065380811691284, 0.07265814393758774, -0.08599108457565308, 0.1208060160279274, -0.0918446034193039, -0.00517148245126009, -0.016071276739239693, 0.027238378301262856, -0.026831841096282005, 0.08005931228399277, -0.030310403555631638, 0.03337544947862625, -0.0036676961462944746, -0.08277016878128052, 0.00305311381816864, -0.06127786636352539, -0.08797083795070648, -0.08973070234060287, 0.05690312013030052, 0.1063297688961029, 0.08180422335863113, 0.12587498128414154, 0.03801511228084564, 0.1365235596895218, -0.03159929811954498, -0.12555770576000214, -0.0250222310423851, -0.025273863226175308, 0.054380305111408234, -0.005587507970631123, -0.003274292452260852, 0.016080833971500397, 0.1403164267539978, 0.09286211431026459, -0.03625383973121643, 0.06709910184144974, -0.08033033460378647, -0.1318332701921463, 0.05281110852956772, 0.10479173809289932, -0.04175495728850365, -0.03289077803492546, 0.030360035598278046, 0.05195415019989014, -0.06639547646045685, 0.003507202723994851, 0.009527861140668392], [0.04035816341638565, 0.040467269718647, -0.014886309392750263, -0.08883225917816162, 0.06747458130121231, 0.10951491445302963, -0.06326664984226227, -0.016916124150156975, 0.09448190778493881, -0.1428283005952835, -0.01211017370223999, 0.08585574477910995, -0.014122217893600464, 0.12942227721214294, -0.0253339521586895, -0.006780092138797045, -0.007499422412365675, 0.11929108947515488, 0.046070270240306854, 0.08511428534984589, 0.154979407787323, -0.13323260843753815, 0.029764406383037567, -0.09513635188341141, -0.05840791389346123, -0.01631207764148712, -0.06927108764648438, -0.08053898811340332, -0.08274313062429428, -0.0413360670208931, 0.12320975959300995, -0.0014558013062924147, 0.06568301469087601, -0.056251052767038345, 0.04209844022989273, 0.023705651983618736, -0.12203774601221085, 0.0493626594543457, 0.06111008673906326, -0.05206363648176193, 0.09970894455909729, -0.017175965011119843, 0.021566346287727356, 0.06644480675458908, 0.015182075090706348, -0.026870623230934143, -0.03791511431336403, 0.05256892740726471, -0.06923596560955048, -0.15052437782287598, 0.08632927387952805, 0.006270464975386858, -0.06840461492538452, 0.10839508473873138, 0.003562025958672166, -0.01587006449699402, 0.03890180215239525, 0.08881576359272003, 0.06749428808689117, 0.01138636190444231, -0.04214984178543091, 0.007660441100597382, 0.02417766861617565, 0.032522641122341156, 0.10541847348213196, -0.1044372171163559, 0.0180561114102602, -0.0008983068983070552, 0.08441413938999176, 0.07310169190168381, -0.06164805591106415, -0.05188589543104172, 0.05330781266093254, 0.009903071448206902, -0.045929260551929474, 0.06319974362850189, -0.035781290382146835, -0.0341854989528656, 0.10741899162530899, 0.060777697712183, 0.034987710416316986, 0.03988609462976456, 0.01271703839302063, -0.08911643177270889, 0.03522263467311859, 0.041555069386959076, -0.010696529410779476, -0.09379490464925766, 0.11444519460201263, -0.03366345167160034, -0.034336864948272705, 0.07612879574298859, -0.034583669155836105, 0.0564628541469574, -0.039798103272914886, -0.019853219389915466, -0.027240602299571037, -0.05133512616157532, -0.08284785598516464, 0.06426841765642166, 0.016140952706336975, 0.05817379802465439, 0.1347934752702713, 0.04820387810468674, 0.05629149451851845, 0.016604123637080193, -0.13149701058864594, -0.03569532930850983, 0.06288976222276688, 0.01643952913582325, -0.10627927631139755, -0.09355641156435013, 0.02411014400422573, 0.06808453798294067, 0.006648809649050236, 0.07674013823270798, -0.0400155633687973, -0.10914535820484161, -0.07547757029533386, 0.025465864688158035, -0.03732633218169212, -0.07314348220825195, 0.07462506741285324, -0.03950108215212822, 0.04429196938872337, -0.032968319952487946, -0.0021575859282165766, -0.07603397965431213], [0.04095730185508728, 0.0334177240729332, 0.10779372602701187, -0.02269366756081581, -0.022054288536310196, 0.1802772581577301, -0.07591839134693146, 0.02724139578640461, 0.006228330545127392, -0.06273900717496872, -0.06143132597208023, 0.09691768139600754, -0.025885939598083496, -0.0045759063214063644, 0.13447682559490204, 0.017861949279904366, 0.09498310089111328, -0.04337497055530548, -0.08041845262050629, 0.08198823034763336, -0.01230783760547638, -0.0022229179739952087, -0.030331818386912346, 0.07022763043642044, -0.12425357848405838, 0.01144383568316698, -0.0073504578322172165, -0.06822911649942398, 0.04411841928958893, -0.15283608436584473, 0.05686797574162483, 0.007503844331949949, 0.007162131369113922, 0.020186983048915863, 0.07107188552618027, 0.015244148671627045, -0.142248272895813, 0.019968543201684952, 0.034854307770729065, 0.03779583424329758, 0.048321157693862915, 0.003965839743614197, 0.07592206448316574, 0.025670699775218964, 0.004607012961059809, 0.007016301155090332, -0.005625896155834198, -0.0031615793704986572, 0.05187828093767166, 0.08991698175668716, 0.01357253734022379, 0.06058613583445549, -0.006746239960193634, -0.05484127998352051, 0.07465381175279617, 0.04577619582414627, -0.06084703281521797, 0.08253777772188187, 0.016029534861445427, 0.008672184310853481, 0.02177511900663376, 0.07451798766851425, -0.0826793685555458, -0.05241985246539116, 0.04448748752474785, 0.003484393237158656, 0.027299493551254272, -0.07002691924571991, 0.07492256909608841, -0.0681765004992485, -0.031943414360284805, 0.07088542729616165, 0.08428721874952316, 0.030322162434458733, 0.05747630447149277, 0.07882506400346756, 0.04949689656496048, -0.11206630617380142, 0.07176719605922699, 0.13458487391471863, -0.04796909540891647, -0.042567022144794464, 0.07588494569063187, -0.015805229544639587, 0.04565997049212456, 0.08884865790605545, 0.016035914421081543, -0.010113649070262909, 0.08042063564062119, -0.05672818049788475, 0.021467387676239014, 0.041190654039382935, 0.030423499643802643, 0.07531212270259857, -0.06865867972373962, -0.07870987802743912, -0.10899829864501953, -0.07157294452190399, 0.09248227626085281, 0.14823028445243835, 0.020383577793836594, 0.04055633768439293, 0.01812065951526165, 0.06699655205011368, -0.03672098368406296, -0.035043150186538696, -0.06886699050664902, -0.061705633997917175, -0.003115132451057434, 0.056379932910203934, 0.06819970905780792, -0.0800948292016983, -0.005869357381016016, 0.03769482672214508, 0.014669746160507202, -0.02894117683172226, -0.058325182646512985, -0.051059313118457794, -0.026454195380210876, 0.06420645117759705, -0.09954308718442917, -0.038220372051000595, 0.12293613702058792, -0.05857449024915695, -0.06321554630994797, 0.07400233298540115, 0.01378865260630846, -0.03150975704193115], [0.028795503079891205, -0.019433405250310898, 0.0637124627828598, -0.06529662013053894, -0.045576658099889755, 0.09152403473854065, 0.016048269346356392, 0.12175753712654114, -9.268502617487684e-05, -0.016423236578702927, -0.03450993075966835, -0.02410229854285717, 0.03715815395116806, -0.024637386202812195, -0.02666144073009491, 0.05999930575489998, 0.03485998511314392, 0.06220715492963791, -0.029441267251968384, 0.07806885242462158, 0.04983222112059593, -0.015576131641864777, 0.020594365894794464, -0.0049439058639109135, -0.0667971819639206, -0.009291484020650387, -0.030146339908242226, 0.03194418549537659, -0.05205582082271576, -0.08090423792600632, 0.04998403042554855, 0.06468614935874939, 0.026455722749233246, 0.0664784237742424, 0.08062499016523361, 0.031529203057289124, -0.0074090962298214436, 0.06882470846176147, -0.03422834724187851, 0.026613928377628326, -0.03749146685004234, -0.06805670261383057, -0.0024527758359909058, 0.03558599203824997, -0.04187377914786339, 0.020952194929122925, 0.020361311733722687, -0.057845670729875565, -0.03593050315976143, -0.005742187146097422, -0.013543756678700447, 0.048905160278081894, -0.014096617698669434, -0.05402587354183197, -0.020871669054031372, 0.03617246448993683, -0.040438685566186905, 0.017404818907380104, 0.04243765398859978, 0.004890910815447569, 0.030551403760910034, 0.018389642238616943, 0.0407164990901947, -0.00613360945135355, 0.029399842023849487, -0.05037802830338478, 0.07456962019205093, -0.006611742079257965, -0.014210003428161144, -0.029360856860876083, -0.08213232457637787, 0.025439709424972534, -0.06634291261434555, -0.02862515300512314, 0.004208087921142578, 0.007829785346984863, -0.05289005488157272, -0.06500019133090973, -0.0012845759047195315, -0.04922756180167198, -0.11890954524278641, 0.04865587502717972, 0.035031192004680634, 0.03820372745394707, -0.08144903928041458, -0.03253239393234253, -0.035469479858875275, -0.02081446349620819, 0.07781526446342468, -0.08264508843421936, -0.0015328526496887207, 0.013321012258529663, 0.025227680802345276, -0.018456008285284042, -0.01951468363404274, 0.005087673664093018, 0.04739139974117279, -0.05052786320447922, 0.05709030106663704, 0.12848995625972748, 0.07819344848394394, -0.012276995927095413, 0.02099863812327385, -0.05695142596960068, 0.04219360277056694, 0.03096759133040905, -0.03470892086625099, 0.06045856326818466, -0.015299148857593536, -0.03844834864139557, 0.02004399523139, 0.009615181013941765, -0.0266342181712389, 0.058556292206048965, -0.028222573921084404, -0.07852859795093536, -0.01803576946258545, -0.07972753793001175, -0.001213926705531776, -0.07650763541460037, 0.004171591252088547, 0.010129652917385101, 0.08001051843166351, 0.0012722089886665344, 0.07240549474954605, 0.0011892691254615784, 0.0398150198161602, -0.04247551038861275], [0.056383661925792694, 0.05709662288427353, 0.0021699145436286926, -0.028267372399568558, -0.0074249207973480225, 0.07369019836187363, -0.05731494724750519, -0.01170988380908966, -0.04703865572810173, 0.037078388035297394, -0.0790482759475708, -0.05316125601530075, -0.04381563514471054, -0.003861337900161743, 0.011269144713878632, 0.0050928592681884766, -0.059913747012615204, -0.030152741819620132, -0.04418573155999184, -0.04358527809381485, -0.019687067717313766, 0.017122752964496613, 0.07836710661649704, -0.023201994597911835, 0.07390112429857254, -0.05820538103580475, -0.01546669751405716, -0.007685661315917969, 0.029576152563095093, 0.022744297981262207, 0.015712521970272064, -0.029901422560214996, -0.042560793459415436, -0.07730439305305481, 0.039910539984703064, 0.010513268411159515, 0.01296340674161911, 0.08104700595140457, -0.012317545711994171, 0.05072072893381119, 0.010098055005073547, -0.011221535503864288, -0.029973667114973068, -0.0760292038321495, -0.05588182806968689, -0.0311502106487751, 0.017176896333694458, 0.0492599681019783, 0.05622593313455582, 0.025147251784801483, -0.05018990859389305, 0.04582790285348892, -0.05394405126571655, 0.00528445839881897, -0.01297798752784729, -0.02338886260986328, -0.0444331094622612, -0.058088093996047974, -0.03903350606560707, -0.07465813308954239, -0.05155780166387558, -0.07238861173391342, 0.06445565074682236, -0.0416131392121315, -0.016826793551445007, -0.006749875843524933, -0.05239202082157135, -0.05547676980495453, 0.054144807159900665, -0.05630204826593399, 0.03156954050064087, 0.02146325260400772, 0.011693075299263, -0.046736977994441986, 0.042297422885894775, -0.0030207559466362, 0.03626538813114166, -0.06099377200007439, -0.038534171879291534, -0.04002219811081886, 0.0029193460941314697, -0.06753022968769073, 0.030374765396118164, -0.07667957246303558, -0.040027864277362823, 0.01322772353887558, 0.04888921231031418, 0.055620722472667694, -0.012330777943134308, -0.06684474647045135, 0.01058582216501236, -0.0634627491235733, 0.023026928305625916, -0.010192811489105225, 0.011339008808135986, 0.042024947702884674, -0.02440044656395912, -0.03009246289730072, -0.07028953731060028, 0.036705583333969116, -0.017220288515090942, 0.02772727608680725, 0.06941819936037064, 0.03632589429616928, 0.06979577988386154, 0.04267529398202896, -0.04330872371792793, 0.02261703461408615, 0.08075299113988876, 0.059587590396404266, 0.026115290820598602, 0.010349608957767487, 0.04546055942773819, 0.0481451079249382, -0.05915674939751625, -0.05003013461828232, -0.06311728805303574, 0.04700333625078201, 0.007883839309215546, -0.030487757176160812, -0.07022964954376221, -0.07877684384584427, 0.06573908776044846, -0.044384222477674484, -0.04681893438100815, -0.011190399527549744, -0.008270896971225739, 0.06223923712968826], [0.07056187838315964, -0.06402382999658585, -0.07223550975322723, 0.007728181779384613, 0.017166264355182648, -0.05226094275712967, -0.003117702901363373, -0.07043662667274475, -0.06849122792482376, 0.04330732673406601, -0.03885379806160927, 0.07157167047262192, -0.07289154827594757, -0.039386723190546036, 0.019137181341648102, -0.03045329824090004, 0.06449218839406967, 0.015810877084732056, -0.013139195740222931, 0.06678176671266556, -0.02735452726483345, -0.008902408182621002, -0.017060033977031708, -0.02520664408802986, -0.06979680061340332, -0.01591385155916214, 0.06374611705541611, 0.06371999531984329, 0.04721304029226303, -0.023856595158576965, 0.029767096042633057, 0.03668934106826782, 0.0725884810090065, -0.007338032126426697, -0.0732564926147461, -0.019296199083328247, 0.008012108504772186, 0.07438596338033676, 0.019541293382644653, -0.06380581110715866, -0.022949475795030594, 0.03686957061290741, -0.026187364012002945, 0.07061853259801865, 0.009894289076328278, -0.020763494074344635, -0.07506826519966125, -0.0011387541890144348, 0.04718971997499466, 0.035391271114349365, 0.013671115040779114, -0.008945062756538391, -0.029435250908136368, 0.042396821081638336, 0.0378565788269043, -0.05003117769956589, 0.055568136274814606, -0.06634324789047241, 0.04041735827922821, 0.01939457654953003, -0.0740092396736145, -0.00019993633031845093, 0.05540452152490616, -0.06865618377923965, -0.034742571413517, -0.060728006064891815, 0.037267185747623444, -0.051690153777599335, 0.0016559362411499023, 0.04184212535619736, 0.044330351054668427, 0.009894400835037231, 0.04894819110631943, 0.0018785223364830017, -0.02482658624649048, -0.037179891020059586, -0.017802603542804718, -0.0230957493185997, -0.03910859674215317, -0.05713856592774391, -0.05716962367296219, 0.07178766280412674, -0.04023023694753647, -0.03743063285946846, 0.022946998476982117, -0.06884055584669113, -0.05772602558135986, -0.07889782637357712, -0.05542513355612755, -0.05125684291124344, -0.055323973298072815, 